{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1728fe50-a3fd-452f-a1eb-98159fcc5702",
   "metadata": {},
   "source": [
    "# Demo Boskalis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "805f1fea-c477-47f5-8dc5-796e99397646",
   "metadata": {},
   "source": [
    "## Create Graph from Project Documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "ad9af4b6-fe4f-4d9e-b9b9-57408b70111c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path\n",
    "from langchain_community.document_loaders import PyPDFLoader\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from pydantic import BaseModel, Field, validator\n",
    "from typing import List, Optional\n",
    "from openai import OpenAI\n",
    "import time\n",
    "import json\n",
    "from json import loads, dumps\n",
    "from neo4j import Query, GraphDatabase, RoutingControl, Result\n",
    "from langchain_openai import OpenAIEmbeddings, ChatOpenAI\n",
    "from IPython.display import clear_output\n",
    "import requests\n",
    "from bs4 import BeautifulSoup\n",
    "from urllib.parse import urljoin"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fa962a42-3403-45b8-bcf6-4174da007eb7",
   "metadata": {},
   "outputs": [],
   "source": [
    "env_file = '../.env'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3897078d-0d71-4f0c-9200-997514acf2e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "if os.path.exists(env_file):\n",
    "    load_dotenv(env_file, override=True)\n",
    "\n",
    "    # Neo4j\n",
    "    HOST = os.getenv('NEO4J_URI')\n",
    "    USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "    PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "    DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "    # AI\n",
    "    OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')\n",
    "    os.environ['OPENAI_API_KEY']=OPENAI_API_KEY\n",
    "    LLM = os.getenv('LLM')\n",
    "    EMBEDDINGS_MODEL = os.getenv('EMBEDDINGS_MODEL')\n",
    "else:\n",
    "    print(f\"File {env_file} not found.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b3085212-a877-430b-bbcb-9c4f62f1c005",
   "metadata": {},
   "outputs": [],
   "source": [
    "projects_documents_path = \"documents/projects/\"\n",
    "equipment_documents_path = \"documents/equipment/\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f41ab51e-41e9-4809-ab87-648d3f829aea",
   "metadata": {},
   "source": [
    "### Test Connection to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "41334e85-be23-43e7-a63b-2ea1c4594b34",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\n",
    "    HOST,\n",
    "    auth=(USERNAME, PASSWORD)\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a2d6ca6e-6aed-40f4-ab2b-19592a75e9a0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Count\n",
       "0      0"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(\n",
    "    \"\"\"\n",
    "    MATCH (n) RETURN COUNT(n) as Count\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.READ,\n",
    "    result_transformer_= lambda r: r.to_df()\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47aff3b0-804f-40bb-9904-0e1dfc38baf6",
   "metadata": {},
   "source": [
    "## Chunk and Load Documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "bf0373c1-c7ec-4169-871c-b0741d4278da",
   "metadata": {},
   "outputs": [],
   "source": [
    "chunk_size = 300\n",
    "chunk_overlap = 50"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c3d64893-f6e0-402d-a6f4-d7996885f7ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "    chunk_size = chunk_size,\n",
    "    chunk_overlap  = chunk_overlap,\n",
    "    length_function = len,\n",
    "    is_separator_regex = False,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "bbd31262-f90a-4bf6-a30d-5ff428b7609d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def parse_documents(documents_path):\n",
    "    documents_dir = Path(documents_path)\n",
    "    chunks_with_metadata = []\n",
    "\n",
    "    for pdf_path in documents_dir.glob(\"*.pdf\"):\n",
    "        print(f\"Parsing: {pdf_path.name}\")\n",
    "        loader = PyPDFLoader(str(pdf_path))\n",
    "        pages = loader.load_and_split()\n",
    "        total_chunks_for_doc = 0\n",
    "        for page in pages:\n",
    "            page_chunks = text_splitter.split_text(page.page_content)\n",
    "            for chunk in page_chunks:\n",
    "                chunks_with_metadata.append({\n",
    "                    \"doc_path\": page.metadata.get(\"doc_path\"),\n",
    "                    \"doc_name\": pdf_path.name,\n",
    "                    \"page\": page.metadata.get(\"page\"),\n",
    "                    \"text\": chunk,\n",
    "                    \"num_chunks\": len(page_chunks)\n",
    "                })\n",
    "                total_chunks_for_doc += 1\n",
    "        print(f\"Chunked {len(pages)} pages into {total_chunks_for_doc} chunks\")\n",
    "    return pd.DataFrame.from_dict(chunks_with_metadata)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "452563fd-9be5-4830-b215-52b6cb2a28d6",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Parsing: italy_-_genoa.pdf\n",
      "Chunked 2 pages into 21 chunks\n",
      "Parsing: FPSo Transportation.pdf\n",
      "Chunked 2 pages into 17 chunks\n",
      "Parsing: Haven Jack Up Upgrade.pdf\n",
      "Chunked 2 pages into 17 chunks\n",
      "Parsing: fox_river_leaflet.pdf\n",
      "Chunked 1 pages into 6 chunks\n",
      "Parsing: uk_-_peterhead.pdf\n",
      "Chunked 2 pages into 19 chunks\n",
      "Parsing: egypt_-suez_canal.pdf\n",
      "Chunked 2 pages into 25 chunks\n",
      "Parsing: togo-benin.pdf\n",
      "Chunked 3 pages into 36 chunks\n",
      "Parsing: Gulhifalhu Phase 2 Maldives.pdf\n",
      "Chunked 2 pages into 31 chunks\n",
      "Parsing: spain_-_seville.pdf\n",
      "Chunked 2 pages into 23 chunks\n",
      "Parsing: abu_dhabi_-_khalifa.pdf\n",
      "Chunked 4 pages into 41 chunks\n",
      "Parsing: 2602020_borssele_alpha.pdf\n",
      "Chunked 2 pages into 22 chunks\n",
      "Parsing: def_baltic_ii.pdf\n",
      "Chunked 2 pages into 25 chunks\n",
      "Parsing: suriname-river.pdf\n",
      "Chunked 2 pages into 26 chunks\n",
      "Parsing: the_netherlands_-_4_nederrijn_measures_room_for_the_river.pdf\n",
      "Chunked 2 pages into 21 chunks\n",
      "Parsing: a2_holendrecht-maarsen.pdf\n",
      "Chunked 2 pages into 23 chunks\n",
      "Parsing: netherlands-north_sea-subsea_well_protection_structures_removal.pdf\n",
      "Chunked 2 pages into 21 chunks\n",
      "Parsing: 20201115_def_wintershall_j6-a.pdf\n",
      "Chunked 2 pages into 19 chunks\n",
      "Parsing: abu_dhabi_-_khalifa_hydronamic.pdf\n",
      "Chunked 3 pages into 34 chunks\n",
      "Parsing: the_netherlands_-_maasvlakte2.pdf\n",
      "Chunked 3 pages into 29 chunks\n",
      "Parsing: Project Sheet LNG Canada Mar 24.pdf\n",
      "Chunked 2 pages into 31 chunks\n",
      "Parsing: awg-ameland.pdf\n",
      "Chunked 2 pages into 23 chunks\n",
      "Parsing: Harbor of Lerwick.pdf\n",
      "Chunked 2 pages into 26 chunks\n",
      "Parsing: le-havre-port-2000.pdf\n",
      "Chunked 3 pages into 33 chunks\n",
      "Parsing: suriname_lelydorp.pdf\n",
      "Chunked 2 pages into 22 chunks\n",
      "Parsing: the_netherlands_-_forelands_excavation_deventer__room_for_the_river.pdf\n",
      "Chunked 2 pages into 17 chunks\n",
      "Parsing: 20181127_aberdeen_bay_offshore_windfarm_project.pdf\n",
      "Chunked 2 pages into 23 chunks\n",
      "Parsing: russia__st_petersburg.pdf\n",
      "Chunked 2 pages into 21 chunks\n",
      "Parsing: trailing_suction_hopper_dredger_barent_zanen.pdf\n",
      "Chunked 2 pages into 6 chunks\n",
      "Parsing: manu-pekka.pdf\n",
      "Chunked 2 pages into 5 chunks\n",
      "Parsing: ndeavor_mpv.pdf\n",
      "Chunked 2 pages into 8 chunks\n",
      "Parsing: crestway.pdf\n",
      "Chunked 2 pages into 9 chunks\n",
      "Parsing: willem-van-oranje.pdf\n",
      "Chunked 2 pages into 7 chunks\n",
      "Parsing: asian-hercules-iii.pdf\n",
      "Chunked 2 pages into 9 chunks\n",
      "Parsing: terra-plana.pdf\n",
      "Chunked 2 pages into 6 chunks\n",
      "Parsing: kamara.pdf\n",
      "Chunked 2 pages into 15 chunks\n",
      "Parsing: rockpiper.pdf\n",
      "Chunked 2 pages into 8 chunks\n",
      "Parsing: trailing_suction_hopper_dredger_beachway.pdf\n",
      "Chunked 2 pages into 6 chunks\n",
      "Parsing: boxer.pdf\n",
      "Chunked 2 pages into 10 chunks\n",
      "Parsing: strandway.pdf\n",
      "Chunked 2 pages into 8 chunks\n",
      "Parsing: bear-27-03.pdf\n",
      "Chunked 2 pages into 9 chunks\n",
      "Parsing: shoalway.pdf\n",
      "Chunked 2 pages into 8 chunks\n",
      "Parsing: boka-vanguard.pdf\n",
      "Chunked 2 pages into 10 chunks\n",
      "Parsing: edax.pdf\n",
      "Chunked 2 pages into 5 chunks\n",
      "Parsing: cornelius-backhoe.pdf\n",
      "Chunked 2 pages into 4 chunks\n",
      "Parsing: transshelf.pdf\n",
      "Chunked 2 pages into 8 chunks\n",
      "Parsing: alexii.pdf\n",
      "Chunked 2 pages into 6 chunks\n",
      "Parsing: ndurance.pdf\n",
      "Chunked 2 pages into 10 chunks\n",
      "Parsing: bssiii.pdf\n",
      "Chunked 2 pages into 17 chunks\n",
      "Parsing: giant-7.pdf\n",
      "Chunked 2 pages into 10 chunks\n",
      "Parsing: waterway.pdf\n",
      "Chunked 2 pages into 7 chunks\n",
      "Parsing: heavy_transport_vessel_forte.pdf\n",
      "Chunked 2 pages into 10 chunks\n",
      "Parsing: shoreway.pdf\n",
      "Chunked 2 pages into 9 chunks\n"
     ]
    }
   ],
   "source": [
    "project_chunks_df = parse_documents(projects_documents_path)\n",
    "equipment_chunks_df = parse_documents(equipment_documents_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f4f439d1-8148-4cac-bc2f-93e312d02dc7",
   "metadata": {},
   "outputs": [],
   "source": [
    "project_chunks_df['category'] = 'project'\n",
    "equipment_chunks_df['category'] = 'equipment'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "832bbc14-8922-45c3-84f6-cfd0f53a0066",
   "metadata": {},
   "outputs": [],
   "source": [
    "chunks_df = pd.concat([project_chunks_df, equipment_chunks_df], ignore_index=True)\n",
    "chunks_df['chunk_seq_id'] = chunks_df.index + 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "1df6566c-a703-4ec1-bd4d-1cfef8ac1bd3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>doc_name</th>\n",
       "      <th>page</th>\n",
       "      <th>text</th>\n",
       "      <th>num_chunks</th>\n",
       "      <th>category</th>\n",
       "      <th>chunk_seq_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>INTRODUCTION\\nThe deepening and extension of t...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>a joint venture with Tecnis S.p.A., an Italian...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>Genoa. \\nSCOPE \\nThe work has been split up in...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>The Trailing Suction Hopper Dredger (TSHD) Ast...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>B1, work continues on filling up area A1, \\nFe...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>857</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>Max. draught Int. load line  5.70 m\\nMax. drau...</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "      <td>858</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>858</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>Sailing speed loaded   13.0 kn\\nTotal installe...</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "      <td>859</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>859</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>Bow thruster   450 kW\\nEQUIPMENT\\nSHEET\\nSHORE...</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "      <td>860</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>1</td>\n",
       "      <td>The information contained in this data sheet i...</td>\n",
       "      <td>2</td>\n",
       "      <td>equipment</td>\n",
       "      <td>861</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>861</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>1</td>\n",
       "      <td>TOP VIEW DECK LEVEL\\nSIDE VIEW\\nSHOREWAY\\nTRAI...</td>\n",
       "      <td>2</td>\n",
       "      <td>equipment</td>\n",
       "      <td>862</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>862 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   source           doc_name  page  \\\n",
       "0    documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "1    documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "2    documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "3    documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "4    documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "..                                    ...                ...   ...   \n",
       "857      documents/equipment/shoreway.pdf       shoreway.pdf     0   \n",
       "858      documents/equipment/shoreway.pdf       shoreway.pdf     0   \n",
       "859      documents/equipment/shoreway.pdf       shoreway.pdf     0   \n",
       "860      documents/equipment/shoreway.pdf       shoreway.pdf     1   \n",
       "861      documents/equipment/shoreway.pdf       shoreway.pdf     1   \n",
       "\n",
       "                                                  text  num_chunks   category  \\\n",
       "0    INTRODUCTION\\nThe deepening and extension of t...          11    project   \n",
       "1    a joint venture with Tecnis S.p.A., an Italian...          11    project   \n",
       "2    Genoa. \\nSCOPE \\nThe work has been split up in...          11    project   \n",
       "3    The Trailing Suction Hopper Dredger (TSHD) Ast...          11    project   \n",
       "4    B1, work continues on filling up area A1, \\nFe...          11    project   \n",
       "..                                                 ...         ...        ...   \n",
       "857  Max. draught Int. load line  5.70 m\\nMax. drau...           7  equipment   \n",
       "858  Sailing speed loaded   13.0 kn\\nTotal installe...           7  equipment   \n",
       "859  Bow thruster   450 kW\\nEQUIPMENT\\nSHEET\\nSHORE...           7  equipment   \n",
       "860  The information contained in this data sheet i...           2  equipment   \n",
       "861  TOP VIEW DECK LEVEL\\nSIDE VIEW\\nSHOREWAY\\nTRAI...           2  equipment   \n",
       "\n",
       "     chunk_seq_id  \n",
       "0               1  \n",
       "1               2  \n",
       "2               3  \n",
       "3               4  \n",
       "4               5  \n",
       "..            ...  \n",
       "857           858  \n",
       "858           859  \n",
       "859           860  \n",
       "860           861  \n",
       "861           862  \n",
       "\n",
       "[862 rows x 7 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chunks_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30a9b760-4ff8-4635-8f6e-49d00ea0a5e0",
   "metadata": {},
   "source": [
    "### Load Documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "d673f43c-69cf-4ae4-8cbc-752a0f80d4b8",
   "metadata": {},
   "outputs": [],
   "source": [
    "document_df = (\n",
    "    chunks_df.groupby(\"doc_name\").agg(\n",
    "        doc_path=(\"doc_path\", \"max\"),\n",
    "        full_text=(\"text\", \" \".join),\n",
    "        pages=(\"page\", \"max\"),\n",
    "        chunks=(\"num_chunks\", \"max\"),\n",
    "        category=(\"category\", \"max\")\n",
    "    )\n",
    "    .reset_index()\n",
    ")\n",
    "document_df['pages'] = document_df['pages'].apply(lambda x: x + 1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "33007cb0-3c40-43d1-90d5-09129057381d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>doc_name</th>\n",
       "      <th>source</th>\n",
       "      <th>full_text</th>\n",
       "      <th>pages</th>\n",
       "      <th>chunks</th>\n",
       "      <th>category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20181127_aberdeen_bay_offshore_windfarm_projec...</td>\n",
       "      <td>documents/projects/20181127_aberdeen_bay_offsh...</td>\n",
       "      <td>A At the fabrication Yard in Newcastle\\nA\\nPRO...</td>\n",
       "      <td>2</td>\n",
       "      <td>16</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>20201115_def_wintershall_j6-a.pdf</td>\n",
       "      <td>documents/projects/20201115_def_wintershall_j6...</td>\n",
       "      <td>PROJECT\\nSHEET\\nUMBILICAL REPLACEMENT AND  \\nA...</td>\n",
       "      <td>2</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2602020_borssele_alpha.pdf</td>\n",
       "      <td>documents/projects/2602020_borssele_alpha.pdf</td>\n",
       "      <td>A Schematic of cable route with in yellow the ...</td>\n",
       "      <td>2</td>\n",
       "      <td>13</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>FPSo Transportation.pdf</td>\n",
       "      <td>documents/projects/FPSo Transportation.pdf</td>\n",
       "      <td>FEATURES\\nClient COOEC (Offshore Oil Engineeri...</td>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Gulhifalhu Phase 2 Maldives.pdf</td>\n",
       "      <td>documents/projects/Gulhifalhu Phase 2 Maldives...</td>\n",
       "      <td>A Gulhifalhu south east corner\\nB Revetment in...</td>\n",
       "      <td>2</td>\n",
       "      <td>16</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Harbor of Lerwick.pdf</td>\n",
       "      <td>documents/projects/Harbor of Lerwick.pdf</td>\n",
       "      <td>INTRODUCTION \\nThe Port of Lerwick is situated...</td>\n",
       "      <td>2</td>\n",
       "      <td>15</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Haven Jack Up Upgrade.pdf</td>\n",
       "      <td>documents/projects/Haven Jack Up Upgrade.pdf</td>\n",
       "      <td>FEATURES\\nClient Lamprell\\nCompany Master Mari...</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Project Sheet LNG Canada Mar 24.pdf</td>\n",
       "      <td>documents/projects/Project Sheet LNG Canada Ma...</td>\n",
       "      <td>A Overview of project site\\nB Trailing suction...</td>\n",
       "      <td>2</td>\n",
       "      <td>16</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>a2_holendrecht-maarsen.pdf</td>\n",
       "      <td>documents/projects/a2_holendrecht-maarsen.pdf</td>\n",
       "      <td>PROJECT \\nSHEET\\nHOLENDRECHT - MAARSSEN, THE N...</td>\n",
       "      <td>2</td>\n",
       "      <td>14</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>abu_dhabi_-_khalifa.pdf</td>\n",
       "      <td>documents/projects/abu_dhabi_-_khalifa.pdf</td>\n",
       "      <td>INTRODUCTION \\nThe Khalifa Port and Industrial...</td>\n",
       "      <td>4</td>\n",
       "      <td>15</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>abu_dhabi_-_khalifa_hydronamic.pdf</td>\n",
       "      <td>documents/projects/abu_dhabi_-_khalifa_hydrona...</td>\n",
       "      <td>INTRODUCTION \\nThe overall KPIZ Project develo...</td>\n",
       "      <td>2</td>\n",
       "      <td>17</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>alexii.pdf</td>\n",
       "      <td>documents/equipment/alexii.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by  Yizhe...</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>asian-hercules-iii.pdf</td>\n",
       "      <td>documents/equipment/asian-hercules-iii.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nASIAN HERCULES III\\n5,000 TO...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>awg-ameland.pdf</td>\n",
       "      <td>documents/projects/awg-ameland.pdf</td>\n",
       "      <td>A CLV Spirit and the platform\\nA\\nPROJECT\\nSHE...</td>\n",
       "      <td>2</td>\n",
       "      <td>13</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>bear-27-03.pdf</td>\n",
       "      <td>documents/equipment/bear-27-03.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nBEAR\\nOFFSHORE VESSELS /  \\n...</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>boka-vanguard.pdf</td>\n",
       "      <td>documents/equipment/boka-vanguard.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nBOKA VANGUARD\\nSEMI-SUBMERSI...</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>boxer.pdf</td>\n",
       "      <td>documents/equipment/boxer.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nBOXER\\nOFFSHORE VESSELS / AN...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>bssiii.pdf</td>\n",
       "      <td>documents/equipment/bssiii.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nBSSIII\\nBURIAL SLEDGE SYSTEM...</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cornelius-backhoe.pdf</td>\n",
       "      <td>documents/equipment/cornelius-backhoe.pdf</td>\n",
       "      <td>CONSTRUCTION/CLASSIFICATION\\nBuilt by  De Dong...</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>crestway.pdf</td>\n",
       "      <td>documents/equipment/crestway.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by  IHC D...</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>def_baltic_ii.pdf</td>\n",
       "      <td>documents/projects/def_baltic_ii.pdf</td>\n",
       "      <td>BOSKALIS’ ENERGY SOLUTIONS\\nBoskalis is a lead...</td>\n",
       "      <td>2</td>\n",
       "      <td>15</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>edax.pdf</td>\n",
       "      <td>documents/equipment/edax.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nEDAX\\nCUTTER SUCTION DREDGER...</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>egypt_-suez_canal.pdf</td>\n",
       "      <td>documents/projects/egypt_-suez_canal.pdf</td>\n",
       "      <td>COMPLEX PLANNING\\nTo ensure the project was co...</td>\n",
       "      <td>2</td>\n",
       "      <td>15</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>fox_river_leaflet.pdf</td>\n",
       "      <td>documents/projects/fox_river_leaflet.pdf</td>\n",
       "      <td>Stuyvesant’s affiliated company Boskalis Dolma...</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>giant-7.pdf</td>\n",
       "      <td>documents/equipment/giant-7.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nYear of constru...</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>heavy_transport_vessel_forte.pdf</td>\n",
       "      <td>documents/equipment/heavy_transport_vessel_for...</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nFORTE\\nSEMI-SUBMERSIBLE DP-2...</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>INTRODUCTION\\nThe deepening and extension of t...</td>\n",
       "      <td>2</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>kamara.pdf</td>\n",
       "      <td>documents/equipment/kamara.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nKAMARA\\nDP II OFFSHORE VESSE...</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>le-havre-port-2000.pdf</td>\n",
       "      <td>documents/projects/le-havre-port-2000.pdf</td>\n",
       "      <td>A TSHD Strandway and TSHD Shoalway\\nB TSHD Wil...</td>\n",
       "      <td>3</td>\n",
       "      <td>14</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>manu-pekka.pdf</td>\n",
       "      <td>documents/equipment/manu-pekka.pdf</td>\n",
       "      <td>MAIN DATA\\nGross tonnage 680 GT\\nLength overal...</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>ndeavor_mpv.pdf</td>\n",
       "      <td>documents/equipment/ndeavor_mpv.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nNDEAVOR\\nMULTIPURPOSE VESSEL...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>ndurance.pdf</td>\n",
       "      <td>documents/equipment/ndurance.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nNDURANCE \\nCABLE LAYING VESS...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>netherlands-north_sea-subsea_well_protection_s...</td>\n",
       "      <td>documents/projects/netherlands-north_sea-subse...</td>\n",
       "      <td>FEATURES\\nLocation Southern North Sea\\nPeriod ...</td>\n",
       "      <td>2</td>\n",
       "      <td>12</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>rockpiper.pdf</td>\n",
       "      <td>documents/equipment/rockpiper.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nVessel built by...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>russia__st_petersburg.pdf</td>\n",
       "      <td>documents/projects/russia__st_petersburg.pdf</td>\n",
       "      <td>INTRODUCTION \\nSt. Petersburg is a UNESCO Worl...</td>\n",
       "      <td>2</td>\n",
       "      <td>12</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>shoalway.pdf</td>\n",
       "      <td>documents/equipment/shoalway.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by  Inter...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>shoreway.pdf</td>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by  IHC D...</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>spain_-_seville.pdf</td>\n",
       "      <td>documents/projects/spain_-_seville.pdf</td>\n",
       "      <td>INTRODUCTION\\nSeville is located 80 km land in...</td>\n",
       "      <td>2</td>\n",
       "      <td>14</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>strandway.pdf</td>\n",
       "      <td>documents/equipment/strandway.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by  Shipk...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>suriname-river.pdf</td>\n",
       "      <td>documents/projects/suriname-river.pdf</td>\n",
       "      <td>BOSKALIS\\nBoskalis is a leading global marine ...</td>\n",
       "      <td>2</td>\n",
       "      <td>14</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>suriname_lelydorp.pdf</td>\n",
       "      <td>documents/projects/suriname_lelydorp.pdf</td>\n",
       "      <td>A\\nPROJECT \\nSHEET\\nLELYDORP, SURINAME\\nBAUXIT...</td>\n",
       "      <td>2</td>\n",
       "      <td>12</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>terra-plana.pdf</td>\n",
       "      <td>documents/equipment/terra-plana.pdf</td>\n",
       "      <td>MAIN DATA\\nLength overall 39.8 m\\nLength b.p.p...</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>the_netherlands_-_4_nederrijn_measures_room_fo...</td>\n",
       "      <td>documents/projects/the_netherlands_-_4_nederri...</td>\n",
       "      <td>PROJECT\\nSHEET\\n4 NEDERRIJN MEASURES\\nROOM FOR...</td>\n",
       "      <td>2</td>\n",
       "      <td>14</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>the_netherlands_-_forelands_excavation_devente...</td>\n",
       "      <td>documents/projects/the_netherlands_-_forelands...</td>\n",
       "      <td>PROJECT\\nSHEET\\nFORELANDS EXCAVATION DEVENTER\\...</td>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>the_netherlands_-_maasvlakte2.pdf</td>\n",
       "      <td>documents/projects/the_netherlands_-_maasvlakt...</td>\n",
       "      <td>INTRODUCTION\\nPUMA, the Project Organization f...</td>\n",
       "      <td>2</td>\n",
       "      <td>15</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>togo-benin.pdf</td>\n",
       "      <td>documents/projects/togo-benin.pdf</td>\n",
       "      <td>A\\nFEATURES\\nClient Government of Togo and Ben...</td>\n",
       "      <td>3</td>\n",
       "      <td>13</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>trailing_suction_hopper_dredger_barent_zanen.pdf</td>\n",
       "      <td>documents/equipment/trailing_suction_hopper_dr...</td>\n",
       "      <td>MAIN DATA\\nGross tonnage 9,773\\nLength overall...</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>trailing_suction_hopper_dredger_beachway.pdf</td>\n",
       "      <td>documents/equipment/trailing_suction_hopper_dr...</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nVessel built by...</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>transshelf.pdf</td>\n",
       "      <td>documents/equipment/transshelf.pdf</td>\n",
       "      <td>EQUIPMENT\\nSHEET\\nTRANSSHELF\\nSEMI-SUBMERSIBLE...</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>uk_-_peterhead.pdf</td>\n",
       "      <td>documents/projects/uk_-_peterhead.pdf</td>\n",
       "      <td>PROJECT DESCRIPTION \\nThe project consisted of...</td>\n",
       "      <td>2</td>\n",
       "      <td>12</td>\n",
       "      <td>project</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>waterway.pdf</td>\n",
       "      <td>documents/equipment/waterway.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by Merwed...</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>willem-van-oranje.pdf</td>\n",
       "      <td>documents/equipment/willem-van-oranje.pdf</td>\n",
       "      <td>CONSTRUCTION / CLASSIFICATION\\nBuilt by IHC Dr...</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>equipment</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             doc_name  \\\n",
       "0   20181127_aberdeen_bay_offshore_windfarm_projec...   \n",
       "1                   20201115_def_wintershall_j6-a.pdf   \n",
       "2                          2602020_borssele_alpha.pdf   \n",
       "3                             FPSo Transportation.pdf   \n",
       "4                     Gulhifalhu Phase 2 Maldives.pdf   \n",
       "5                               Harbor of Lerwick.pdf   \n",
       "6                           Haven Jack Up Upgrade.pdf   \n",
       "7                 Project Sheet LNG Canada Mar 24.pdf   \n",
       "8                          a2_holendrecht-maarsen.pdf   \n",
       "9                             abu_dhabi_-_khalifa.pdf   \n",
       "10                 abu_dhabi_-_khalifa_hydronamic.pdf   \n",
       "11                                         alexii.pdf   \n",
       "12                             asian-hercules-iii.pdf   \n",
       "13                                    awg-ameland.pdf   \n",
       "14                                     bear-27-03.pdf   \n",
       "15                                  boka-vanguard.pdf   \n",
       "16                                          boxer.pdf   \n",
       "17                                         bssiii.pdf   \n",
       "18                              cornelius-backhoe.pdf   \n",
       "19                                       crestway.pdf   \n",
       "20                                  def_baltic_ii.pdf   \n",
       "21                                           edax.pdf   \n",
       "22                              egypt_-suez_canal.pdf   \n",
       "23                              fox_river_leaflet.pdf   \n",
       "24                                        giant-7.pdf   \n",
       "25                   heavy_transport_vessel_forte.pdf   \n",
       "26                                  italy_-_genoa.pdf   \n",
       "27                                         kamara.pdf   \n",
       "28                             le-havre-port-2000.pdf   \n",
       "29                                     manu-pekka.pdf   \n",
       "30                                    ndeavor_mpv.pdf   \n",
       "31                                       ndurance.pdf   \n",
       "32  netherlands-north_sea-subsea_well_protection_s...   \n",
       "33                                      rockpiper.pdf   \n",
       "34                          russia__st_petersburg.pdf   \n",
       "35                                       shoalway.pdf   \n",
       "36                                       shoreway.pdf   \n",
       "37                                spain_-_seville.pdf   \n",
       "38                                      strandway.pdf   \n",
       "39                                 suriname-river.pdf   \n",
       "40                              suriname_lelydorp.pdf   \n",
       "41                                    terra-plana.pdf   \n",
       "42  the_netherlands_-_4_nederrijn_measures_room_fo...   \n",
       "43  the_netherlands_-_forelands_excavation_devente...   \n",
       "44                  the_netherlands_-_maasvlakte2.pdf   \n",
       "45                                     togo-benin.pdf   \n",
       "46   trailing_suction_hopper_dredger_barent_zanen.pdf   \n",
       "47       trailing_suction_hopper_dredger_beachway.pdf   \n",
       "48                                     transshelf.pdf   \n",
       "49                                 uk_-_peterhead.pdf   \n",
       "50                                       waterway.pdf   \n",
       "51                              willem-van-oranje.pdf   \n",
       "\n",
       "                                               source  \\\n",
       "0   documents/projects/20181127_aberdeen_bay_offsh...   \n",
       "1   documents/projects/20201115_def_wintershall_j6...   \n",
       "2       documents/projects/2602020_borssele_alpha.pdf   \n",
       "3          documents/projects/FPSo Transportation.pdf   \n",
       "4   documents/projects/Gulhifalhu Phase 2 Maldives...   \n",
       "5            documents/projects/Harbor of Lerwick.pdf   \n",
       "6        documents/projects/Haven Jack Up Upgrade.pdf   \n",
       "7   documents/projects/Project Sheet LNG Canada Ma...   \n",
       "8       documents/projects/a2_holendrecht-maarsen.pdf   \n",
       "9          documents/projects/abu_dhabi_-_khalifa.pdf   \n",
       "10  documents/projects/abu_dhabi_-_khalifa_hydrona...   \n",
       "11                     documents/equipment/alexii.pdf   \n",
       "12         documents/equipment/asian-hercules-iii.pdf   \n",
       "13                 documents/projects/awg-ameland.pdf   \n",
       "14                 documents/equipment/bear-27-03.pdf   \n",
       "15              documents/equipment/boka-vanguard.pdf   \n",
       "16                      documents/equipment/boxer.pdf   \n",
       "17                     documents/equipment/bssiii.pdf   \n",
       "18          documents/equipment/cornelius-backhoe.pdf   \n",
       "19                   documents/equipment/crestway.pdf   \n",
       "20               documents/projects/def_baltic_ii.pdf   \n",
       "21                       documents/equipment/edax.pdf   \n",
       "22           documents/projects/egypt_-suez_canal.pdf   \n",
       "23           documents/projects/fox_river_leaflet.pdf   \n",
       "24                    documents/equipment/giant-7.pdf   \n",
       "25  documents/equipment/heavy_transport_vessel_for...   \n",
       "26               documents/projects/italy_-_genoa.pdf   \n",
       "27                     documents/equipment/kamara.pdf   \n",
       "28          documents/projects/le-havre-port-2000.pdf   \n",
       "29                 documents/equipment/manu-pekka.pdf   \n",
       "30                documents/equipment/ndeavor_mpv.pdf   \n",
       "31                   documents/equipment/ndurance.pdf   \n",
       "32  documents/projects/netherlands-north_sea-subse...   \n",
       "33                  documents/equipment/rockpiper.pdf   \n",
       "34       documents/projects/russia__st_petersburg.pdf   \n",
       "35                   documents/equipment/shoalway.pdf   \n",
       "36                   documents/equipment/shoreway.pdf   \n",
       "37             documents/projects/spain_-_seville.pdf   \n",
       "38                  documents/equipment/strandway.pdf   \n",
       "39              documents/projects/suriname-river.pdf   \n",
       "40           documents/projects/suriname_lelydorp.pdf   \n",
       "41                documents/equipment/terra-plana.pdf   \n",
       "42  documents/projects/the_netherlands_-_4_nederri...   \n",
       "43  documents/projects/the_netherlands_-_forelands...   \n",
       "44  documents/projects/the_netherlands_-_maasvlakt...   \n",
       "45                  documents/projects/togo-benin.pdf   \n",
       "46  documents/equipment/trailing_suction_hopper_dr...   \n",
       "47  documents/equipment/trailing_suction_hopper_dr...   \n",
       "48                 documents/equipment/transshelf.pdf   \n",
       "49              documents/projects/uk_-_peterhead.pdf   \n",
       "50                   documents/equipment/waterway.pdf   \n",
       "51          documents/equipment/willem-van-oranje.pdf   \n",
       "\n",
       "                                            full_text  pages  chunks  \\\n",
       "0   A At the fabrication Yard in Newcastle\\nA\\nPRO...      2      16   \n",
       "1   PROJECT\\nSHEET\\nUMBILICAL REPLACEMENT AND  \\nA...      2      11   \n",
       "2   A Schematic of cable route with in yellow the ...      2      13   \n",
       "3   FEATURES\\nClient COOEC (Offshore Oil Engineeri...      2      10   \n",
       "4   A Gulhifalhu south east corner\\nB Revetment in...      2      16   \n",
       "5   INTRODUCTION \\nThe Port of Lerwick is situated...      2      15   \n",
       "6   FEATURES\\nClient Lamprell\\nCompany Master Mari...      2       9   \n",
       "7   A Overview of project site\\nB Trailing suction...      2      16   \n",
       "8   PROJECT \\nSHEET\\nHOLENDRECHT - MAARSSEN, THE N...      2      14   \n",
       "9   INTRODUCTION \\nThe Khalifa Port and Industrial...      4      15   \n",
       "10  INTRODUCTION \\nThe overall KPIZ Project develo...      2      17   \n",
       "11  CONSTRUCTION / CLASSIFICATION\\nBuilt by  Yizhe...      2       4   \n",
       "12  EQUIPMENT\\nSHEET\\nASIAN HERCULES III\\n5,000 TO...      2       6   \n",
       "13  A CLV Spirit and the platform\\nA\\nPROJECT\\nSHE...      2      13   \n",
       "14  EQUIPMENT\\nSHEET\\nBEAR\\nOFFSHORE VESSELS /  \\n...      2       5   \n",
       "15  EQUIPMENT\\nSHEET\\nBOKA VANGUARD\\nSEMI-SUBMERSI...      2       7   \n",
       "16  EQUIPMENT\\nSHEET\\nBOXER\\nOFFSHORE VESSELS / AN...      2       6   \n",
       "17  EQUIPMENT\\nSHEET\\nBSSIII\\nBURIAL SLEDGE SYSTEM...      2       9   \n",
       "18  CONSTRUCTION/CLASSIFICATION\\nBuilt by  De Dong...      2       2   \n",
       "19  CONSTRUCTION / CLASSIFICATION\\nBuilt by  IHC D...      2       7   \n",
       "20  BOSKALIS’ ENERGY SOLUTIONS\\nBoskalis is a lead...      2      15   \n",
       "21  EQUIPMENT\\nSHEET\\nEDAX\\nCUTTER SUCTION DREDGER...      2       3   \n",
       "22  COMPLEX PLANNING\\nTo ensure the project was co...      2      15   \n",
       "23  Stuyvesant’s affiliated company Boskalis Dolma...      1       6   \n",
       "24  CONSTRUCTION / CLASSIFICATION\\nYear of constru...      2       5   \n",
       "25  EQUIPMENT\\nSHEET\\nFORTE\\nSEMI-SUBMERSIBLE DP-2...      2       7   \n",
       "26  INTRODUCTION\\nThe deepening and extension of t...      2      11   \n",
       "27  EQUIPMENT\\nSHEET\\nKAMARA\\nDP II OFFSHORE VESSE...      2       9   \n",
       "28  A TSHD Strandway and TSHD Shoalway\\nB TSHD Wil...      3      14   \n",
       "29  MAIN DATA\\nGross tonnage 680 GT\\nLength overal...      2       3   \n",
       "30  EQUIPMENT\\nSHEET\\nNDEAVOR\\nMULTIPURPOSE VESSEL...      2       6   \n",
       "31  EQUIPMENT\\nSHEET\\nNDURANCE \\nCABLE LAYING VESS...      2       6   \n",
       "32  FEATURES\\nLocation Southern North Sea\\nPeriod ...      2      12   \n",
       "33  CONSTRUCTION / CLASSIFICATION\\nVessel built by...      2       6   \n",
       "34  INTRODUCTION \\nSt. Petersburg is a UNESCO Worl...      2      12   \n",
       "35  CONSTRUCTION / CLASSIFICATION\\nBuilt by  Inter...      2       6   \n",
       "36  CONSTRUCTION / CLASSIFICATION\\nBuilt by  IHC D...      2       7   \n",
       "37  INTRODUCTION\\nSeville is located 80 km land in...      2      14   \n",
       "38  CONSTRUCTION / CLASSIFICATION\\nBuilt by  Shipk...      2       6   \n",
       "39  BOSKALIS\\nBoskalis is a leading global marine ...      2      14   \n",
       "40  A\\nPROJECT \\nSHEET\\nLELYDORP, SURINAME\\nBAUXIT...      2      12   \n",
       "41  MAIN DATA\\nLength overall 39.8 m\\nLength b.p.p...      2       4   \n",
       "42  PROJECT\\nSHEET\\n4 NEDERRIJN MEASURES\\nROOM FOR...      2      14   \n",
       "43  PROJECT\\nSHEET\\nFORELANDS EXCAVATION DEVENTER\\...      2      10   \n",
       "44  INTRODUCTION\\nPUMA, the Project Organization f...      2      15   \n",
       "45  A\\nFEATURES\\nClient Government of Togo and Ben...      3      13   \n",
       "46  MAIN DATA\\nGross tonnage 9,773\\nLength overall...      2       4   \n",
       "47  CONSTRUCTION / CLASSIFICATION\\nVessel built by...      2       4   \n",
       "48  EQUIPMENT\\nSHEET\\nTRANSSHELF\\nSEMI-SUBMERSIBLE...      2       6   \n",
       "49  PROJECT DESCRIPTION \\nThe project consisted of...      2      12   \n",
       "50  CONSTRUCTION / CLASSIFICATION\\nBuilt by Merwed...      2       5   \n",
       "51  CONSTRUCTION / CLASSIFICATION\\nBuilt by IHC Dr...      2       5   \n",
       "\n",
       "     category  \n",
       "0     project  \n",
       "1     project  \n",
       "2     project  \n",
       "3     project  \n",
       "4     project  \n",
       "5     project  \n",
       "6     project  \n",
       "7     project  \n",
       "8     project  \n",
       "9     project  \n",
       "10    project  \n",
       "11  equipment  \n",
       "12  equipment  \n",
       "13    project  \n",
       "14  equipment  \n",
       "15  equipment  \n",
       "16  equipment  \n",
       "17  equipment  \n",
       "18  equipment  \n",
       "19  equipment  \n",
       "20    project  \n",
       "21  equipment  \n",
       "22    project  \n",
       "23    project  \n",
       "24  equipment  \n",
       "25  equipment  \n",
       "26    project  \n",
       "27  equipment  \n",
       "28    project  \n",
       "29  equipment  \n",
       "30  equipment  \n",
       "31  equipment  \n",
       "32    project  \n",
       "33  equipment  \n",
       "34    project  \n",
       "35  equipment  \n",
       "36  equipment  \n",
       "37    project  \n",
       "38  equipment  \n",
       "39    project  \n",
       "40    project  \n",
       "41  equipment  \n",
       "42    project  \n",
       "43    project  \n",
       "44    project  \n",
       "45    project  \n",
       "46  equipment  \n",
       "47  equipment  \n",
       "48  equipment  \n",
       "49    project  \n",
       "50  equipment  \n",
       "51  equipment  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "document_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e62e604-c2c2-47d5-a6ed-945a1db12266",
   "metadata": {},
   "source": [
    "Load URL's of Documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "2110b26d-ef27-4b97-a258-40a9eecc85cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "PAGE = \"https://boskalis.com/download-center\"\n",
    "BASE = \"https://boskalis.com\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "c4070f37-b179-4e60-8316-0a239a9523f3",
   "metadata": {},
   "outputs": [],
   "source": [
    "def fetch_pdf_table():\n",
    "    r = requests.get(PAGE, headers={\"User-Agent\": \"Mozilla/5.0\"}, timeout=20)\n",
    "    r.raise_for_status()\n",
    "    soup = BeautifulSoup(r.text, \"html.parser\")\n",
    "\n",
    "    rows = []\n",
    "    seen = set()\n",
    "\n",
    "    for a in soup.find_all(\"a\", href=True):\n",
    "        href = a[\"href\"].split(\"?\")[0].strip()\n",
    "        if href.lower().endswith(\".pdf\"):\n",
    "            full = href if href.startswith(\"http\") else urljoin(BASE, href)\n",
    "            if full in seen:\n",
    "                continue\n",
    "            seen.add(full)\n",
    "            file_name = full.rstrip(\"/\").split(\"/\")[-1]  # keep .pdf\n",
    "            rows.append({\"doc_name\": file_name, \"url\": full})\n",
    "\n",
    "    df = pd.DataFrame(rows).drop_duplicates().reset_index(drop=True)\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "af534a1f-9319-4020-902e-9ca7995a72b1",
   "metadata": {},
   "outputs": [],
   "source": [
    "urls_df = fetch_pdf_table()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "56b8a342-ee5e-4dc0-b60b-a60b85249073",
   "metadata": {},
   "outputs": [],
   "source": [
    "document_df = pd.merge(document_df, urls_df, on=\"doc_name\", how=\"left\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2b741d56-7450-4ebb-8ab9-8b6edc2a1b13",
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_document_query = \"\"\"\n",
    "    MERGE(mergedDocument:Document {name: $doc_name})\n",
    "    SET mergedDocument.doc_path = $doc_path,\n",
    "        mergedDocument.full_text = $full_text,\n",
    "        mergedDocument.pages = $pages,\n",
    "        mergedDocument.chunks = $chunks,\n",
    "        mergedDocument.category = $category,\n",
    "        mergedDocument.url = $url\n",
    "        \n",
    "    RETURN mergedDocument\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "ad75b8e1-7908-4719-807b-0187b3dfbcf5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded willem-van-oranje.pdf\n",
      "Progress:  100.0 %\n"
     ]
    }
   ],
   "source": [
    "for index, row in document_df.iterrows():\n",
    "    clear_output(wait=True)\n",
    "    driver.execute_query(\n",
    "        merge_document_query,\n",
    "        database_=DATABASE,\n",
    "        routing_=RoutingControl.WRITE,\n",
    "        doc_name = row.doc_name,\n",
    "        doc_path = row.doc_path,\n",
    "        full_text = row.full_text,\n",
    "        pages = row.pages,\n",
    "        chunks = row.chunks,\n",
    "        category = row.category,\n",
    "        url = row.url,\n",
    "    )\n",
    "    print(f\"Loaded {row['doc_name']}\")\n",
    "    print(\"Progress: \", np.round((index+1)/document_df.shape[0]*100,2), \"%\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "605d796c-a276-48fc-bd6d-5a85e549c30c",
   "metadata": {},
   "source": [
    "### Load Chunks"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f5e8a6e6-e482-4afd-bdb6-ebbb1fb5fc73",
   "metadata": {},
   "source": [
    "First add Embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "279c7d20-ce0e-4399-a280-75c8c73fa15d",
   "metadata": {},
   "outputs": [],
   "source": [
    "embeddings_model = OpenAIEmbeddings(\n",
    "    model = EMBEDDINGS_MODEL,\n",
    "    openai_api_key = OPENAI_API_KEY\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e92d3874-c10c-4c6b-a4ba-f37645f1e0fb",
   "metadata": {},
   "source": [
    "Add an embedding for every chunk in the DataFrame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "1455a942-231b-4935-b782-bc6c5007cf66",
   "metadata": {},
   "outputs": [],
   "source": [
    "chunks_df['embedding'] = chunks_df['text'].apply(lambda x: embeddings_model.embed_query(x))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "0163a1d5-4d1e-4891-8cb7-cc005c8b3ee5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>doc_name</th>\n",
       "      <th>page</th>\n",
       "      <th>text</th>\n",
       "      <th>num_chunks</th>\n",
       "      <th>category</th>\n",
       "      <th>chunk_seq_id</th>\n",
       "      <th>embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>INTRODUCTION\\nThe deepening and extension of t...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>1</td>\n",
       "      <td>[0.006220303475856781, -0.0248403362929821, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>a joint venture with Tecnis S.p.A., an Italian...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>2</td>\n",
       "      <td>[0.007828463800251484, -0.025723079219460487, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>Genoa. \\nSCOPE \\nThe work has been split up in...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>3</td>\n",
       "      <td>[-0.003091271501034498, -0.02294781804084778, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>The Trailing Suction Hopper Dredger (TSHD) Ast...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>4</td>\n",
       "      <td>[-0.006104578264057636, -0.005901559256017208,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>italy_-_genoa.pdf</td>\n",
       "      <td>0</td>\n",
       "      <td>B1, work continues on filling up area A1, \\nFe...</td>\n",
       "      <td>11</td>\n",
       "      <td>project</td>\n",
       "      <td>5</td>\n",
       "      <td>[-0.0036728905979543924, -0.03611675649881363,...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 source           doc_name  page  \\\n",
       "0  documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "1  documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "2  documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "3  documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "4  documents/projects/italy_-_genoa.pdf  italy_-_genoa.pdf     0   \n",
       "\n",
       "                                                text  num_chunks category  \\\n",
       "0  INTRODUCTION\\nThe deepening and extension of t...          11  project   \n",
       "1  a joint venture with Tecnis S.p.A., an Italian...          11  project   \n",
       "2  Genoa. \\nSCOPE \\nThe work has been split up in...          11  project   \n",
       "3  The Trailing Suction Hopper Dredger (TSHD) Ast...          11  project   \n",
       "4  B1, work continues on filling up area A1, \\nFe...          11  project   \n",
       "\n",
       "   chunk_seq_id                                          embedding  \n",
       "0             1  [0.006220303475856781, -0.0248403362929821, 0....  \n",
       "1             2  [0.007828463800251484, -0.025723079219460487, ...  \n",
       "2             3  [-0.003091271501034498, -0.02294781804084778, ...  \n",
       "3             4  [-0.006104578264057636, -0.005901559256017208,...  \n",
       "4             5  [-0.0036728905979543924, -0.03611675649881363,...  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chunks_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "4fef60a3-4aa8-4bda-a4ba-e209f9a1c2b4",
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_chunck_query = \"\"\"\n",
    "    MERGE(c:Chunk {id: $chunk_seq_id})\n",
    "        ON CREATE SET\n",
    "            c.page = $page,\n",
    "            c.text = $text,\n",
    "            c.embedding = $embedding\n",
    "    WITH c\n",
    "    MATCH (d:Document{name: $doc_name})\n",
    "    MERGE (c)-[r:PART_OF]->(d)\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "5e14ac82-2836-4f5d-903f-cd8f2b89ff14",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Progress:  100.0 %\n"
     ]
    }
   ],
   "source": [
    "for index, row in chunks_df.iterrows():\n",
    "    clear_output(wait=True)\n",
    "    driver.execute_query(\n",
    "        merge_chunck_query,\n",
    "        database_=DATABASE,\n",
    "        routing_=RoutingControl.WRITE,\n",
    "        chunk_seq_id = row.chunk_seq_id,\n",
    "        page = row.page,\n",
    "        text = row.text,\n",
    "        embedding = row.embedding,\n",
    "        doc_name = row.doc_name\n",
    "    )\n",
    "    print(\"Progress: \", np.round(((index+1)/chunks_df.shape[0])*100,2), \"%\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d047fb7-eae0-4e86-a04b-f5c5b8a03223",
   "metadata": {},
   "source": [
    "## Project Entities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "305e9c24-2eb8-4b8c-a4cf-6653a46dca2a",
   "metadata": {},
   "source": [
    "Let's extract projects from a Project Documents"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e2cff29-4c07-4b9a-a8df-a3913d6a825a",
   "metadata": {},
   "source": [
    "### Extract Project Entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "3d259a60-168b-4378-b859-bbdc6bf42c0f",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Location(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents the location of a project\n",
    "    \"\"\"\n",
    "    location: str = Field(..., description=\"Location were the project was carried out\")\n",
    "    country: str =  Field(..., description=\"Country where the location is based\")\n",
    "    country_code: str = Field(..., description=\"Country code according to the ISO 3166-1 alpha-3 country codes\")\n",
    "\n",
    "class Equipment(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents the Equipment used in the project. This class contains one equipment with its specific name and no generic name.\n",
    "    \"\"\"\n",
    "    name: str = Field(..., description=\"Name of the equipment used in the project\")\n",
    "    description: Optional[str] =  Field(..., description=\"Short description of the equipment useded in the project if provided\")\n",
    "\n",
    "class Contractor(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents a Contractor of a project\n",
    "    \"\"\"\n",
    "    name: str = Field(..., description=\"Name of the contractor of the project\")\n",
    "    description: Optional[str] =  Field(..., description=\"Short description of the contractor if provided\")\n",
    "\n",
    "class Client(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents a client of a project\n",
    "    \"\"\"\n",
    "    name: str = Field(..., description=\"Name of the client of the project\")\n",
    "    description: Optional[str] =  Field(..., description=\"Short description of the client if provided\")\n",
    "\n",
    "class Project(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents a question with answer from the press conferences with ECB.\n",
    "    \"\"\"\n",
    "    doc_path: str = Field(..., description=\"The path of the document\")\n",
    "    name: str = Field(..., description=\"The name of the project\")\n",
    "    date: str = Field(..., description=\"The date of the project\")\n",
    "    description: str = Field(..., description=\"Short description of the project that was carried out\")\n",
    "    client: List[Client] = Field(..., description=\"List of clients for this project\")\n",
    "    contractor: List[Contractor] = Field(..., description=\"List of contractors for this project\")\n",
    "    equipment: List[Equipment] = Field(..., description=\"List of equipment used in this project. If multiple equipment is used split into different objects.\")\n",
    "    location: List[Location] = Field(..., description=\"Location of this project\")\n",
    "\n",
    "class ProjectList(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents a list of projects based carried out. \n",
    "    \"\"\"\n",
    "    projects: List[Project]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "5974789f-adc3-46c1-81da-87a2c456a099",
   "metadata": {},
   "outputs": [],
   "source": [
    "system_message = \"\"\"\n",
    "    You are an expert in extracting structured information text. \n",
    "    In this case we want to extract Information of projects from documents. The text is coming from short documents on a project carried out by Boskalis.\n",
    "    Please extract the information as specified in the provided format.\n",
    "\n",
    "    Identify details such as:\n",
    "    - Project that is carried out.\n",
    "    - More information like equipment used, contractor, client and location the project was carried out.\n",
    "    - Please be specific on the contractor. Typically these are different entities of Boskalis. \n",
    "    - If a description is asked, please generate a short summary based on the text.\n",
    "    - For Equipment use the specific name of that equipment no generic names as (e.g. ignore Grab dredger, Suction Hopper Dredger, etc). \n",
    "\n",
    "    Don't come up with anything yourself. Just base it on the documents fully.\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "6049a61b-f3a8-4ce6-9829-53ad9f0d2154",
   "metadata": {},
   "outputs": [],
   "source": [
    "client = OpenAI()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "5c711d8c-aaed-40c1-bad3-27faeea268f8",
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract(document, model=LLM, temperature=0):\n",
    "    response = client.beta.chat.completions.parse(\n",
    "        model=model,\n",
    "        temperature=temperature,\n",
    "        messages=[\n",
    "            {\"role\": \"system\", \"content\": system_message},\n",
    "            {\"role\": \"user\", \"content\": document},\n",
    "        ],\n",
    "        response_format=ProjectList,\n",
    "    )\n",
    "    return json.loads(response.choices[0].message.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "3fd65a9f-09d7-424c-9db6-d12f1e4ed208",
   "metadata": {},
   "outputs": [],
   "source": [
    "columns = ['doc_path', 'name', 'date', 'description', 'client', 'contractor', 'equipment', 'location']\n",
    "projects_df = pd.DataFrame(columns=columns)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "9be2daeb-3bb7-4662-ac79-96712d9701e0",
   "metadata": {},
   "outputs": [],
   "source": [
    "project_documents_df = document_df[document_df['category'] == 'project'].reset_index(drop=True)\n",
    "\n",
    "for idx, row in project_documents_df.iterrows():\n",
    "    text = project_documents_df['full_text'].iloc[idx]\n",
    "    extracted_projects = extract(\"Document Path:\" + project_documents_df['doc_path'].iloc[idx] + \"\\n\" + text)\n",
    "    ProjectList.model_validate(extracted_projects)\n",
    "    df = pd.json_normalize(extracted_projects[\"projects\"])\n",
    "    projects_df = pd.concat([projects_df, df], ignore_index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "eb532a81-af40-4fc5-91d3-992ce50bbcf6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>name</th>\n",
       "      <th>date</th>\n",
       "      <th>description</th>\n",
       "      <th>client</th>\n",
       "      <th>contractor</th>\n",
       "      <th>equipment</th>\n",
       "      <th>location</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>documents/projects/20181127_aberdeen_bay_offsh...</td>\n",
       "      <td>Aberdeen Bay Offshore Windfarm Project</td>\n",
       "      <td>2016 - 2018</td>\n",
       "      <td>The Aberdeen Bay Offshore Windfarm Project, al...</td>\n",
       "      <td>[{'name': 'Vattenfall', 'description': None}]</td>\n",
       "      <td>[{'name': 'Boskalis', 'description': 'Royal Bo...</td>\n",
       "      <td>[{'name': 'Asian Hercules III', 'description':...</td>\n",
       "      <td>[{'location': 'Aberdeen, Scotland', 'country':...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>documents/projects/20201115_def_wintershall_j6...</td>\n",
       "      <td>Umbilical Replacement and Accumulator Rack Cha...</td>\n",
       "      <td>Q2, 2019</td>\n",
       "      <td>The project involved replacing the SSIV contro...</td>\n",
       "      <td>[{'name': 'Wintershall Noordzee B.V.', 'descri...</td>\n",
       "      <td>[{'name': 'Boskalis', 'description': 'Royal Bo...</td>\n",
       "      <td>[{'name': 'DSV ‘EDT Protea’', 'description': N...</td>\n",
       "      <td>[{'location': 'Block J6-A', 'country': 'The Ne...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>documents/projects/2602020_borssele_alpha.pdf</td>\n",
       "      <td>Borssele Alpha/Beta Export Cables</td>\n",
       "      <td>2018 - 2020</td>\n",
       "      <td>The project involved the supply and installati...</td>\n",
       "      <td>[{'name': 'Tennet TSO B.V.', 'description': No...</td>\n",
       "      <td>[{'name': 'VBNK (consortium Boskalis Subsea Ca...</td>\n",
       "      <td>[{'name': 'Cable Lay Barge Giant 7', 'descript...</td>\n",
       "      <td>[{'location': 'Borssele', 'country': 'Netherla...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>documents/projects/FPSo Transportation.pdf</td>\n",
       "      <td>P67 FPSO Transportation</td>\n",
       "      <td>2018</td>\n",
       "      <td>Boskalis executed the dry transportation of th...</td>\n",
       "      <td>[{'name': 'COOEC (Offshore Oil Engineering Co....</td>\n",
       "      <td>[{'name': 'Royal Boskalis Westminster', 'descr...</td>\n",
       "      <td>[{'name': 'MV Boka Vanguard', 'description': '...</td>\n",
       "      <td>[{'location': 'Shanghai', 'country': 'China', ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>documents/projects/Gulhifalhu Phase 2 Maldives...</td>\n",
       "      <td>Gulhifalhu Phase 2</td>\n",
       "      <td>2023 - 2024</td>\n",
       "      <td>The Gulhifalhu Phase 2 project involved the ex...</td>\n",
       "      <td>[{'name': 'Government of the Republic of Maldi...</td>\n",
       "      <td>[{'name': 'Boskalis Westminster Contracting Li...</td>\n",
       "      <td>[{'name': 'Oranje', 'description': 'A trailing...</td>\n",
       "      <td>[{'location': 'Gulhifalhu Lagoon, North Malé A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>documents/projects/Harbor of Lerwick.pdf</td>\n",
       "      <td>North Harbor of Lerwick Dredging and Reclamation</td>\n",
       "      <td>2007 – 2008</td>\n",
       "      <td>The project involved dredging and reclamation ...</td>\n",
       "      <td>[{'name': 'Lerwick Port Authority', 'descripti...</td>\n",
       "      <td>[{'name': 'Westminster Dredging Co.', 'descrip...</td>\n",
       "      <td>[{'name': 'TSHD Waterway', 'description': 'Use...</td>\n",
       "      <td>[{'location': 'Port of Lerwick, Scotland', 'co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>documents/projects/Haven Jack Up Upgrade.pdf</td>\n",
       "      <td>Haven Jack-Up Upgrade</td>\n",
       "      <td>January - February 2018</td>\n",
       "      <td>The Haven Jack-Up Upgrade project involved the...</td>\n",
       "      <td>[{'name': 'Lamprell', 'description': None}]</td>\n",
       "      <td>[{'name': 'Royal Boskalis Westminster', 'descr...</td>\n",
       "      <td>[{'name': 'Asian Hercules III', 'description':...</td>\n",
       "      <td>[{'location': 'CCB Ågotnes', 'country': 'Norwa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>documents/projects/Project Sheet LNG Canada Ma...</td>\n",
       "      <td>LNG Canada Dredging and Disposal Services</td>\n",
       "      <td>2018 - 2021</td>\n",
       "      <td>Boskalis was involved in the LNG Canada projec...</td>\n",
       "      <td>[{'name': 'LNG Canada Development Inc., Shell'...</td>\n",
       "      <td>[{'name': 'Boskalis', 'description': 'Boskalis...</td>\n",
       "      <td>[{'name': 'Beachway', 'description': 'Trailing...</td>\n",
       "      <td>[{'location': 'Kitimat, British Columbia', 'co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>documents/projects/a2_holendrecht-maarsen.pdf</td>\n",
       "      <td>Reconstruction of A2 Motorway Holendrecht-Maar...</td>\n",
       "      <td>October 2006 – mid-2012</td>\n",
       "      <td>The project involved the reconstruction and wi...</td>\n",
       "      <td>[{'name': 'Rijkswaterstaat', 'description': 'D...</td>\n",
       "      <td>[{'name': 'A2HoMa consortium', 'description': ...</td>\n",
       "      <td>[{'name': 'Hydronamic', 'description': 'Boskal...</td>\n",
       "      <td>[{'location': 'A2 Motorway, Utrecht – Amsterda...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>documents/projects/abu_dhabi_-_khalifa.pdf</td>\n",
       "      <td>Khalifa Port and Industrial Zone (KPIZ) Project</td>\n",
       "      <td>October 2007 – January 2012</td>\n",
       "      <td>The Khalifa Port and Industrial Zone (KPIZ) pr...</td>\n",
       "      <td>[{'name': 'Abu Dhabi Ports Company (ADPC)', 'd...</td>\n",
       "      <td>[{'name': 'Khalifa Port Marine Consortium (KPM...</td>\n",
       "      <td>[{'name': 'TsHD Alpha B', 'description': 'A sh...</td>\n",
       "      <td>[{'location': 'Al Taweelah, Abu Dhabi', 'count...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>documents/projects/abu_dhabi_-_khalifa_hydrona...</td>\n",
       "      <td>Khalifa Port and Industrial Zone (KPIZ) Project</td>\n",
       "      <td>2008-02/2010-09</td>\n",
       "      <td>The project involves the relocation of Port Za...</td>\n",
       "      <td>[{'name': 'Abu Dhabi Port Company (ADPC)', 'de...</td>\n",
       "      <td>[{'name': 'Boskalis Middle East Ltd', 'descrip...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'location': 'Abu Dhabi', 'country': 'United ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>documents/projects/awg-ameland.pdf</td>\n",
       "      <td>AWG Ameland</td>\n",
       "      <td>2020 - 2021</td>\n",
       "      <td>Boskalis was contracted by NAM for the cable i...</td>\n",
       "      <td>[{'name': 'NAM (Nederlandse Aardolie Maatschap...</td>\n",
       "      <td>[{'name': 'Boskalis Subsea Cables B.V.', 'desc...</td>\n",
       "      <td>[{'name': 'Boka Spirit', 'description': 'Cable...</td>\n",
       "      <td>[{'location': 'Ameland', 'country': 'Netherlan...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>documents/projects/def_baltic_ii.pdf</td>\n",
       "      <td>Baltic II Offshore Wind Farm</td>\n",
       "      <td>December 2013 - October 2014</td>\n",
       "      <td>Boskalis was involved in the Baltic II Offshor...</td>\n",
       "      <td>[{'name': 'EnBW AG', 'description': None}]</td>\n",
       "      <td>[{'name': 'ArGe – JV Hochtief, GeoSea Nordsee'...</td>\n",
       "      <td>[{'name': 'Taklift 4', 'description': 'A self-...</td>\n",
       "      <td>[{'location': 'Baltic Sea, approximately 32 km...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>documents/projects/egypt_-suez_canal.pdf</td>\n",
       "      <td>New Suez Canal Dredging Project</td>\n",
       "      <td>November 2014 – August 2015</td>\n",
       "      <td>The project involved dredging a 35 km long New...</td>\n",
       "      <td>[{'name': 'Suez Canal Authority', 'description...</td>\n",
       "      <td>[{'name': 'Challenge Consortium', 'description...</td>\n",
       "      <td>[{'name': 'Cutter suction dredger Edax', 'desc...</td>\n",
       "      <td>[{'location': 'Suez Canal', 'country': 'Egypt'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>documents/projects/fox_river_leaflet.pdf</td>\n",
       "      <td>Fox River Cleanup</td>\n",
       "      <td>2008</td>\n",
       "      <td>The Fox River Cleanup project involves dredgin...</td>\n",
       "      <td>[{'name': 'Tetra Tech', 'description': None}]</td>\n",
       "      <td>[{'name': 'Stuyvesant Environmental Contractin...</td>\n",
       "      <td>[{'name': 'Membrane Plate and Frame Presses', ...</td>\n",
       "      <td>[{'location': 'Green Bay, Wisconsin', 'country...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>documents/projects/italy_-_genoa.pdf</td>\n",
       "      <td>Deepening and Extending the Port of Genoa, Italy</td>\n",
       "      <td>2009-2014</td>\n",
       "      <td>The project involved deepening and extending t...</td>\n",
       "      <td>[{'name': 'Port Authority of Genoa', 'descript...</td>\n",
       "      <td>[{'name': 'Boskalis Italia S.r.l.', 'descripti...</td>\n",
       "      <td>[{'name': 'TSHD Astra', 'description': 'A Trai...</td>\n",
       "      <td>[{'location': 'Genoa', 'country': 'Italy', 'co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>documents/projects/le-havre-port-2000.pdf</td>\n",
       "      <td>Le Havre Port 2000 3rd Phase - Realization of ...</td>\n",
       "      <td>November 2019 - December 2022</td>\n",
       "      <td>The project involved the construction of 700 m...</td>\n",
       "      <td>[{'name': 'Grand Port Maritime du Havre', 'des...</td>\n",
       "      <td>[{'name': 'Joint Venture Soletanche Bachy - At...</td>\n",
       "      <td>[{'name': 'TSHD Shoalway', 'description': None...</td>\n",
       "      <td>[{'location': 'Le Havre', 'country': 'France',...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>documents/projects/netherlands-north_sea-subse...</td>\n",
       "      <td>Subsea Well Protection Structures Removal</td>\n",
       "      <td>2014 - 2016</td>\n",
       "      <td>Boskalis was contracted to remove Subsea Well ...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'name': 'Boskalis Offshore Marine Contractin...</td>\n",
       "      <td>[{'name': 'Taklift 4', 'description': 'A heavy...</td>\n",
       "      <td>[{'location': 'Southern North Sea', 'country':...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>documents/projects/russia__st_petersburg.pdf</td>\n",
       "      <td>Completing a Flood Protection Barrier, a Navig...</td>\n",
       "      <td>August 2006 to May 2011</td>\n",
       "      <td>The project involved the construction of a sto...</td>\n",
       "      <td>[{'name': 'Ministry of Regional Development of...</td>\n",
       "      <td>[{'name': 'Boskalis bv', 'description': 'Sole ...</td>\n",
       "      <td>[{'name': 'TSHd 'Barent Zanen'', 'description'...</td>\n",
       "      <td>[{'location': 'St. Petersburg', 'country': 'Ru...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>documents/projects/spain_-_seville.pdf</td>\n",
       "      <td>Port of Seville Maritime Access Improvement Ca...</td>\n",
       "      <td>2006 - 2010</td>\n",
       "      <td>The project involved the deepening and widenin...</td>\n",
       "      <td>[{'name': 'Autoridad Portuaria de Sevilla', 'd...</td>\n",
       "      <td>[{'name': 'Esclusa Sevilla UTE', 'description'...</td>\n",
       "      <td>[{'name': 'CSD Para I', 'description': 'A 3,40...</td>\n",
       "      <td>[{'location': 'Seville', 'country': 'Spain', '...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>documents/projects/suriname-river.pdf</td>\n",
       "      <td>Suriname River Dredging Project</td>\n",
       "      <td>October 2022 - July 2023</td>\n",
       "      <td>The project involved deepening and widening th...</td>\n",
       "      <td>[{'name': 'Ministry of Public Works of the Rep...</td>\n",
       "      <td>[{'name': 'Boskalis International BV', 'descri...</td>\n",
       "      <td>[{'name': 'TSHD Crestway', 'description': 'A t...</td>\n",
       "      <td>[{'location': 'Paramaribo', 'country': 'Surina...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>documents/projects/suriname_lelydorp.pdf</td>\n",
       "      <td>Bauxite Mining in Lelydorp</td>\n",
       "      <td>2011 - 2015</td>\n",
       "      <td>Boskalis International was contracted by Sural...</td>\n",
       "      <td>[{'name': 'Suralco L.L.C.', 'description': 'An...</td>\n",
       "      <td>[{'name': 'Boskalis International', 'descripti...</td>\n",
       "      <td>[{'name': 'Orion', 'description': 'A Boskalis ...</td>\n",
       "      <td>[{'location': 'Lelydorp', 'country': 'Suriname...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>documents/projects/the_netherlands_-_4_nederri...</td>\n",
       "      <td>4 Nederrijn Measures - Room for the River</td>\n",
       "      <td>2011 - 2014</td>\n",
       "      <td>The project involved expanding the foreland of...</td>\n",
       "      <td>[{'name': 'Directorate-General for Public Work...</td>\n",
       "      <td>[{'name': 'Boskalis Nederland B.V.', 'descript...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'location': 'Elst (U), Lienden, Doorwerth', ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>documents/projects/the_netherlands_-_forelands...</td>\n",
       "      <td>Forelands Excavation Deventer - Room for the R...</td>\n",
       "      <td>2011 - 2015</td>\n",
       "      <td>The project aimed to improve water safety by e...</td>\n",
       "      <td>[{'name': 'Water Board Groot Salland', 'descri...</td>\n",
       "      <td>[{'name': 'IJsselfront Consortium', 'descripti...</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'location': 'Deventer', 'country': 'Netherla...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>documents/projects/the_netherlands_-_maasvlakt...</td>\n",
       "      <td>Maasvlakte 2</td>\n",
       "      <td>2008 - 2013</td>\n",
       "      <td>The Maasvlakte 2 project involved the extensio...</td>\n",
       "      <td>[{'name': 'Rotterdam Port Authority', 'descrip...</td>\n",
       "      <td>[{'name': 'PUMA', 'description': 'A joint vent...</td>\n",
       "      <td>[{'name': 'TSHD ‘Oranje’', 'description': None...</td>\n",
       "      <td>[{'location': 'Port of Rotterdam', 'country': ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>documents/projects/togo-benin.pdf</td>\n",
       "      <td>Cross-Border Coastal Protection, Togo - Benin</td>\n",
       "      <td>February 2022 - September 2023</td>\n",
       "      <td>The project aimed to protect a 14 km long cros...</td>\n",
       "      <td>[{'name': 'Government of Togo and Benin - Mini...</td>\n",
       "      <td>[{'name': 'Boskalis International BV', 'descri...</td>\n",
       "      <td>[{'name': 'TSHD Willem van Oranje', 'descripti...</td>\n",
       "      <td>[{'location': 'Coastline from Grand Popo, Beni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>documents/projects/uk_-_peterhead.pdf</td>\n",
       "      <td>Peterhead Smith Embankment Development</td>\n",
       "      <td>April 2009 – September 2010</td>\n",
       "      <td>The project involved capital dredging, reclama...</td>\n",
       "      <td>[{'name': 'Peterhead Port Authority', 'descrip...</td>\n",
       "      <td>[{'name': 'Westminster Dredging Co. Ltd.', 'de...</td>\n",
       "      <td>[{'name': 'Manu Pekka', 'description': 'Backho...</td>\n",
       "      <td>[{'location': 'Peterhead, Aberdeenshire', 'cou...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               source  \\\n",
       "0   documents/projects/20181127_aberdeen_bay_offsh...   \n",
       "1   documents/projects/20201115_def_wintershall_j6...   \n",
       "2       documents/projects/2602020_borssele_alpha.pdf   \n",
       "3          documents/projects/FPSo Transportation.pdf   \n",
       "4   documents/projects/Gulhifalhu Phase 2 Maldives...   \n",
       "5            documents/projects/Harbor of Lerwick.pdf   \n",
       "6        documents/projects/Haven Jack Up Upgrade.pdf   \n",
       "7   documents/projects/Project Sheet LNG Canada Ma...   \n",
       "8       documents/projects/a2_holendrecht-maarsen.pdf   \n",
       "9          documents/projects/abu_dhabi_-_khalifa.pdf   \n",
       "10  documents/projects/abu_dhabi_-_khalifa_hydrona...   \n",
       "11                 documents/projects/awg-ameland.pdf   \n",
       "12               documents/projects/def_baltic_ii.pdf   \n",
       "13           documents/projects/egypt_-suez_canal.pdf   \n",
       "14           documents/projects/fox_river_leaflet.pdf   \n",
       "15               documents/projects/italy_-_genoa.pdf   \n",
       "16          documents/projects/le-havre-port-2000.pdf   \n",
       "17  documents/projects/netherlands-north_sea-subse...   \n",
       "18       documents/projects/russia__st_petersburg.pdf   \n",
       "19             documents/projects/spain_-_seville.pdf   \n",
       "20              documents/projects/suriname-river.pdf   \n",
       "21           documents/projects/suriname_lelydorp.pdf   \n",
       "22  documents/projects/the_netherlands_-_4_nederri...   \n",
       "23  documents/projects/the_netherlands_-_forelands...   \n",
       "24  documents/projects/the_netherlands_-_maasvlakt...   \n",
       "25                  documents/projects/togo-benin.pdf   \n",
       "26              documents/projects/uk_-_peterhead.pdf   \n",
       "\n",
       "                                                 name  \\\n",
       "0              Aberdeen Bay Offshore Windfarm Project   \n",
       "1   Umbilical Replacement and Accumulator Rack Cha...   \n",
       "2                   Borssele Alpha/Beta Export Cables   \n",
       "3                             P67 FPSO Transportation   \n",
       "4                                  Gulhifalhu Phase 2   \n",
       "5    North Harbor of Lerwick Dredging and Reclamation   \n",
       "6                               Haven Jack-Up Upgrade   \n",
       "7           LNG Canada Dredging and Disposal Services   \n",
       "8   Reconstruction of A2 Motorway Holendrecht-Maar...   \n",
       "9     Khalifa Port and Industrial Zone (KPIZ) Project   \n",
       "10    Khalifa Port and Industrial Zone (KPIZ) Project   \n",
       "11                                        AWG Ameland   \n",
       "12                       Baltic II Offshore Wind Farm   \n",
       "13                    New Suez Canal Dredging Project   \n",
       "14                                  Fox River Cleanup   \n",
       "15   Deepening and Extending the Port of Genoa, Italy   \n",
       "16  Le Havre Port 2000 3rd Phase - Realization of ...   \n",
       "17          Subsea Well Protection Structures Removal   \n",
       "18  Completing a Flood Protection Barrier, a Navig...   \n",
       "19  Port of Seville Maritime Access Improvement Ca...   \n",
       "20                    Suriname River Dredging Project   \n",
       "21                         Bauxite Mining in Lelydorp   \n",
       "22          4 Nederrijn Measures - Room for the River   \n",
       "23  Forelands Excavation Deventer - Room for the R...   \n",
       "24                                       Maasvlakte 2   \n",
       "25      Cross-Border Coastal Protection, Togo - Benin   \n",
       "26             Peterhead Smith Embankment Development   \n",
       "\n",
       "                              date  \\\n",
       "0                      2016 - 2018   \n",
       "1                         Q2, 2019   \n",
       "2                      2018 - 2020   \n",
       "3                             2018   \n",
       "4                      2023 - 2024   \n",
       "5                      2007 – 2008   \n",
       "6          January - February 2018   \n",
       "7                      2018 - 2021   \n",
       "8          October 2006 – mid-2012   \n",
       "9      October 2007 – January 2012   \n",
       "10                 2008-02/2010-09   \n",
       "11                     2020 - 2021   \n",
       "12    December 2013 - October 2014   \n",
       "13     November 2014 – August 2015   \n",
       "14                            2008   \n",
       "15                       2009-2014   \n",
       "16   November 2019 - December 2022   \n",
       "17                     2014 - 2016   \n",
       "18         August 2006 to May 2011   \n",
       "19                     2006 - 2010   \n",
       "20        October 2022 - July 2023   \n",
       "21                     2011 - 2015   \n",
       "22                     2011 - 2014   \n",
       "23                     2011 - 2015   \n",
       "24                     2008 - 2013   \n",
       "25  February 2022 - September 2023   \n",
       "26     April 2009 – September 2010   \n",
       "\n",
       "                                          description  \\\n",
       "0   The Aberdeen Bay Offshore Windfarm Project, al...   \n",
       "1   The project involved replacing the SSIV contro...   \n",
       "2   The project involved the supply and installati...   \n",
       "3   Boskalis executed the dry transportation of th...   \n",
       "4   The Gulhifalhu Phase 2 project involved the ex...   \n",
       "5   The project involved dredging and reclamation ...   \n",
       "6   The Haven Jack-Up Upgrade project involved the...   \n",
       "7   Boskalis was involved in the LNG Canada projec...   \n",
       "8   The project involved the reconstruction and wi...   \n",
       "9   The Khalifa Port and Industrial Zone (KPIZ) pr...   \n",
       "10  The project involves the relocation of Port Za...   \n",
       "11  Boskalis was contracted by NAM for the cable i...   \n",
       "12  Boskalis was involved in the Baltic II Offshor...   \n",
       "13  The project involved dredging a 35 km long New...   \n",
       "14  The Fox River Cleanup project involves dredgin...   \n",
       "15  The project involved deepening and extending t...   \n",
       "16  The project involved the construction of 700 m...   \n",
       "17  Boskalis was contracted to remove Subsea Well ...   \n",
       "18  The project involved the construction of a sto...   \n",
       "19  The project involved the deepening and widenin...   \n",
       "20  The project involved deepening and widening th...   \n",
       "21  Boskalis International was contracted by Sural...   \n",
       "22  The project involved expanding the foreland of...   \n",
       "23  The project aimed to improve water safety by e...   \n",
       "24  The Maasvlakte 2 project involved the extensio...   \n",
       "25  The project aimed to protect a 14 km long cros...   \n",
       "26  The project involved capital dredging, reclama...   \n",
       "\n",
       "                                               client  \\\n",
       "0       [{'name': 'Vattenfall', 'description': None}]   \n",
       "1   [{'name': 'Wintershall Noordzee B.V.', 'descri...   \n",
       "2   [{'name': 'Tennet TSO B.V.', 'description': No...   \n",
       "3   [{'name': 'COOEC (Offshore Oil Engineering Co....   \n",
       "4   [{'name': 'Government of the Republic of Maldi...   \n",
       "5   [{'name': 'Lerwick Port Authority', 'descripti...   \n",
       "6         [{'name': 'Lamprell', 'description': None}]   \n",
       "7   [{'name': 'LNG Canada Development Inc., Shell'...   \n",
       "8   [{'name': 'Rijkswaterstaat', 'description': 'D...   \n",
       "9   [{'name': 'Abu Dhabi Ports Company (ADPC)', 'd...   \n",
       "10  [{'name': 'Abu Dhabi Port Company (ADPC)', 'de...   \n",
       "11  [{'name': 'NAM (Nederlandse Aardolie Maatschap...   \n",
       "12         [{'name': 'EnBW AG', 'description': None}]   \n",
       "13  [{'name': 'Suez Canal Authority', 'description...   \n",
       "14      [{'name': 'Tetra Tech', 'description': None}]   \n",
       "15  [{'name': 'Port Authority of Genoa', 'descript...   \n",
       "16  [{'name': 'Grand Port Maritime du Havre', 'des...   \n",
       "17                                                 []   \n",
       "18  [{'name': 'Ministry of Regional Development of...   \n",
       "19  [{'name': 'Autoridad Portuaria de Sevilla', 'd...   \n",
       "20  [{'name': 'Ministry of Public Works of the Rep...   \n",
       "21  [{'name': 'Suralco L.L.C.', 'description': 'An...   \n",
       "22  [{'name': 'Directorate-General for Public Work...   \n",
       "23  [{'name': 'Water Board Groot Salland', 'descri...   \n",
       "24  [{'name': 'Rotterdam Port Authority', 'descrip...   \n",
       "25  [{'name': 'Government of Togo and Benin - Mini...   \n",
       "26  [{'name': 'Peterhead Port Authority', 'descrip...   \n",
       "\n",
       "                                           contractor  \\\n",
       "0   [{'name': 'Boskalis', 'description': 'Royal Bo...   \n",
       "1   [{'name': 'Boskalis', 'description': 'Royal Bo...   \n",
       "2   [{'name': 'VBNK (consortium Boskalis Subsea Ca...   \n",
       "3   [{'name': 'Royal Boskalis Westminster', 'descr...   \n",
       "4   [{'name': 'Boskalis Westminster Contracting Li...   \n",
       "5   [{'name': 'Westminster Dredging Co.', 'descrip...   \n",
       "6   [{'name': 'Royal Boskalis Westminster', 'descr...   \n",
       "7   [{'name': 'Boskalis', 'description': 'Boskalis...   \n",
       "8   [{'name': 'A2HoMa consortium', 'description': ...   \n",
       "9   [{'name': 'Khalifa Port Marine Consortium (KPM...   \n",
       "10  [{'name': 'Boskalis Middle East Ltd', 'descrip...   \n",
       "11  [{'name': 'Boskalis Subsea Cables B.V.', 'desc...   \n",
       "12  [{'name': 'ArGe – JV Hochtief, GeoSea Nordsee'...   \n",
       "13  [{'name': 'Challenge Consortium', 'description...   \n",
       "14  [{'name': 'Stuyvesant Environmental Contractin...   \n",
       "15  [{'name': 'Boskalis Italia S.r.l.', 'descripti...   \n",
       "16  [{'name': 'Joint Venture Soletanche Bachy - At...   \n",
       "17  [{'name': 'Boskalis Offshore Marine Contractin...   \n",
       "18  [{'name': 'Boskalis bv', 'description': 'Sole ...   \n",
       "19  [{'name': 'Esclusa Sevilla UTE', 'description'...   \n",
       "20  [{'name': 'Boskalis International BV', 'descri...   \n",
       "21  [{'name': 'Boskalis International', 'descripti...   \n",
       "22  [{'name': 'Boskalis Nederland B.V.', 'descript...   \n",
       "23  [{'name': 'IJsselfront Consortium', 'descripti...   \n",
       "24  [{'name': 'PUMA', 'description': 'A joint vent...   \n",
       "25  [{'name': 'Boskalis International BV', 'descri...   \n",
       "26  [{'name': 'Westminster Dredging Co. Ltd.', 'de...   \n",
       "\n",
       "                                            equipment  \\\n",
       "0   [{'name': 'Asian Hercules III', 'description':...   \n",
       "1   [{'name': 'DSV ‘EDT Protea’', 'description': N...   \n",
       "2   [{'name': 'Cable Lay Barge Giant 7', 'descript...   \n",
       "3   [{'name': 'MV Boka Vanguard', 'description': '...   \n",
       "4   [{'name': 'Oranje', 'description': 'A trailing...   \n",
       "5   [{'name': 'TSHD Waterway', 'description': 'Use...   \n",
       "6   [{'name': 'Asian Hercules III', 'description':...   \n",
       "7   [{'name': 'Beachway', 'description': 'Trailing...   \n",
       "8   [{'name': 'Hydronamic', 'description': 'Boskal...   \n",
       "9   [{'name': 'TsHD Alpha B', 'description': 'A sh...   \n",
       "10                                                 []   \n",
       "11  [{'name': 'Boka Spirit', 'description': 'Cable...   \n",
       "12  [{'name': 'Taklift 4', 'description': 'A self-...   \n",
       "13  [{'name': 'Cutter suction dredger Edax', 'desc...   \n",
       "14  [{'name': 'Membrane Plate and Frame Presses', ...   \n",
       "15  [{'name': 'TSHD Astra', 'description': 'A Trai...   \n",
       "16  [{'name': 'TSHD Shoalway', 'description': None...   \n",
       "17  [{'name': 'Taklift 4', 'description': 'A heavy...   \n",
       "18  [{'name': 'TSHd 'Barent Zanen'', 'description'...   \n",
       "19  [{'name': 'CSD Para I', 'description': 'A 3,40...   \n",
       "20  [{'name': 'TSHD Crestway', 'description': 'A t...   \n",
       "21  [{'name': 'Orion', 'description': 'A Boskalis ...   \n",
       "22                                                 []   \n",
       "23                                                 []   \n",
       "24  [{'name': 'TSHD ‘Oranje’', 'description': None...   \n",
       "25  [{'name': 'TSHD Willem van Oranje', 'descripti...   \n",
       "26  [{'name': 'Manu Pekka', 'description': 'Backho...   \n",
       "\n",
       "                                             location  \n",
       "0   [{'location': 'Aberdeen, Scotland', 'country':...  \n",
       "1   [{'location': 'Block J6-A', 'country': 'The Ne...  \n",
       "2   [{'location': 'Borssele', 'country': 'Netherla...  \n",
       "3   [{'location': 'Shanghai', 'country': 'China', ...  \n",
       "4   [{'location': 'Gulhifalhu Lagoon, North Malé A...  \n",
       "5   [{'location': 'Port of Lerwick, Scotland', 'co...  \n",
       "6   [{'location': 'CCB Ågotnes', 'country': 'Norwa...  \n",
       "7   [{'location': 'Kitimat, British Columbia', 'co...  \n",
       "8   [{'location': 'A2 Motorway, Utrecht – Amsterda...  \n",
       "9   [{'location': 'Al Taweelah, Abu Dhabi', 'count...  \n",
       "10  [{'location': 'Abu Dhabi', 'country': 'United ...  \n",
       "11  [{'location': 'Ameland', 'country': 'Netherlan...  \n",
       "12  [{'location': 'Baltic Sea, approximately 32 km...  \n",
       "13  [{'location': 'Suez Canal', 'country': 'Egypt'...  \n",
       "14  [{'location': 'Green Bay, Wisconsin', 'country...  \n",
       "15  [{'location': 'Genoa', 'country': 'Italy', 'co...  \n",
       "16  [{'location': 'Le Havre', 'country': 'France',...  \n",
       "17  [{'location': 'Southern North Sea', 'country':...  \n",
       "18  [{'location': 'St. Petersburg', 'country': 'Ru...  \n",
       "19  [{'location': 'Seville', 'country': 'Spain', '...  \n",
       "20  [{'location': 'Paramaribo', 'country': 'Surina...  \n",
       "21  [{'location': 'Lelydorp', 'country': 'Suriname...  \n",
       "22  [{'location': 'Elst (U), Lienden, Doorwerth', ...  \n",
       "23  [{'location': 'Deventer', 'country': 'Netherla...  \n",
       "24  [{'location': 'Port of Rotterdam', 'country': ...  \n",
       "25  [{'location': 'Coastline from Grand Popo, Beni...  \n",
       "26  [{'location': 'Peterhead, Aberdeenshire', 'cou...  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "projects_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b69e437a-65f1-468f-9f66-9d699ca0e7cb",
   "metadata": {},
   "source": [
    "### Load Projects to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "07e20f86-bc97-41d4-b271-d9eecc1e3669",
   "metadata": {},
   "outputs": [],
   "source": [
    "CREATE_PROJECT_QUERY = \"\"\"\n",
    "MERGE (p:Project {name: $name})\n",
    "SET  p.doc_path = $doc_path,\n",
    "     p.date = $date,\n",
    "     p.description = $description\n",
    "\n",
    "WITH p\n",
    "CALL (p) {\n",
    "    MATCH (d:Document{doc_path: $doc_path})\n",
    "    MERGE (p)-[:HAS_DOCUMENT]->(d)\n",
    "}\n",
    "\n",
    "WITH p\n",
    "CALL (p) {\n",
    "    UNWIND $clients AS c\n",
    "    MERGE (client:Client {name: c.name})\n",
    "    SET client.description = c.description\n",
    "    MERGE (p)-[:HAS_CLIENT]->(client)\n",
    "}\n",
    "\n",
    "WITH p\n",
    "CALL (p) {\n",
    "    UNWIND $contractors AS ct\n",
    "    MERGE (contractor:Contractor {name: ct.name})\n",
    "    SET contractor.description = ct.description\n",
    "    MERGE (p)-[:HAS_CONTRACTOR]->(contractor)\n",
    "}\n",
    "\n",
    "WITH p\n",
    "CALL (p) {\n",
    "    UNWIND $equipment AS e\n",
    "    MERGE (eq:Equipment {name: e.name})\n",
    "    SET eq.description = e.description\n",
    "    MERGE (p)-[:USED_EQUIPMENT]->(eq)\n",
    "}\n",
    "\n",
    "WITH p\n",
    "CALL (p) {\n",
    "    UNWIND $locations AS l\n",
    "    MERGE (loc:Location {name: l.location})\n",
    "    MERGE (country:Country {code: l.country_code})\n",
    "    SET country.name = l.country\n",
    "    MERGE (loc)-[:IN_COUNTRY]->(country)\n",
    "    MERGE (p)-[:AT_LOCATION]->(loc)\n",
    "};\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "85fdc4cb-43b9-4467-bbf4-7957a45bb2eb",
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_project_row(row):\n",
    "    driver.execute_query(\n",
    "        CREATE_PROJECT_QUERY,\n",
    "        name=row[\"name\"],\n",
    "        doc_path=row[\"doc_path\"],\n",
    "        date=row[\"date\"],\n",
    "        description=row[\"description\"],\n",
    "        clients=row[\"client\"],\n",
    "        contractors=row[\"contractor\"],\n",
    "        equipment=row[\"equipment\"],\n",
    "        locations=row[\"location\"],     \n",
    "        database_=DATABASE,\n",
    "        routing_=RoutingControl.WRITE,\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "c0bec90c-19d9-42ee-b17f-3352d104a6ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "for idx, row in projects_df.iterrows():\n",
    "    insert_project_row(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "187d069a-6617-4ce8-8314-014ffbc1aa5a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>project_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   project_count\n",
       "0             26"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(\n",
    "    \"\"\"\n",
    "    MATCH (p:Project) RETURN COUNT(p) AS project_count\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.READ,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e699df3-57ba-437f-a0db-1ec9a87df3cb",
   "metadata": {},
   "source": [
    "## Equipment Entities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e0e2351b-5fa1-43c5-a030-b4797fd82711",
   "metadata": {},
   "source": [
    "Let's extract projects from a Equipment Documents"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49150906-ed0c-44d0-9bd6-8a927227cbab",
   "metadata": {},
   "source": [
    "### Extract Equipment Entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "41323814-d13f-4965-8bdb-20d7e7558a0f",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Location(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents the location of equipment\n",
    "    \"\"\"\n",
    "    location: str = Field(..., description=\"Location were the equipment was registered\")\n",
    "    country: str =  Field(..., description=\"Country where the location is based\")\n",
    "    country_code: str = Field(..., description=\"Country code according to the ISO 3166-1 alpha-3 country codes\")\n",
    "\n",
    "class Equipment(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents the equipment that can be used in projects\n",
    "    \"\"\"\n",
    "    doc_path: str = Field(..., description=\"The path of the document\")\n",
    "    name: str = Field(..., description=\"Name of the equipment used in the project\")\n",
    "    year_of_construction: Optional[int] =  Field(..., description=\"Year of the equipment being constructed\")\n",
    "    capacity: Optional[str] =  Field(..., description=\"Capacity of the equipment\")\n",
    "    built_by: Optional[str] =  Field(..., description=\"Company the equipment was being built by\")\n",
    "    imo_number: Optional[int] =  Field(..., description=\"The IMO (International Maritime Organization)\")\n",
    "    port_of_registery: List[Location] = Field(..., description=\"Location of the port of registery of this equipment\")\n",
    "    description: Optional[str] =  Field(..., description=\"Short description of the equipment useded in the project if provided\")\n",
    "\n",
    "class EquipmentList(BaseModel):\n",
    "    \"\"\"\n",
    "    Represents a list of equipment described in the documents. \n",
    "    \"\"\"\n",
    "    equipments: List[Equipment]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "514c8609-e86a-48bb-bdfe-611368267246",
   "metadata": {},
   "outputs": [],
   "source": [
    "system_message = \"\"\"\n",
    "    You are an expert in extracting structured information text. \n",
    "    In this case we want to extract information of equipment from documents. The text is coming from short documents on equipment of Boskalis.\n",
    "    Please extract the information as specified in the provided format.\n",
    "\n",
    "    Identify details such as:\n",
    "    - Equipment that is described.\n",
    "    - More properties like description, capacity, year of construction, classification etc. \n",
    "\n",
    "    Don't come up with anything yourself. Just base it on the documents fully.\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "fe8f2120-0a85-40c8-ab66-c64b4e514d19",
   "metadata": {},
   "outputs": [],
   "source": [
    "client = OpenAI()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "8278cac0-ce24-4294-b550-54ee36d6cfd7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract(document, model=LLM, temperature=0):\n",
    "    response = client.beta.chat.completions.parse(\n",
    "        model=model,\n",
    "        temperature=temperature,\n",
    "        messages=[\n",
    "            {\"role\": \"system\", \"content\": system_message},\n",
    "            {\"role\": \"user\", \"content\": document},\n",
    "        ],\n",
    "        response_format=EquipmentList,\n",
    "    )\n",
    "    return json.loads(response.choices[0].message.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "858dcde2-660f-4327-b786-78954413bc00",
   "metadata": {},
   "outputs": [],
   "source": [
    "columns = ['doc_path', 'name', 'year_of_construction', 'capacity', 'built_by', 'imo_number', 'port_of_registery', 'description']\n",
    "equipment_df = pd.DataFrame(columns=columns)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "10514434-980f-40e9-8bac-f6d20292b240",
   "metadata": {},
   "outputs": [],
   "source": [
    "equipment_documents_df = document_df[document_df['category'] == 'equipment'].reset_index(drop=True)\n",
    "\n",
    "for idx, row in equipment_documents_df.iterrows():\n",
    "    text = equipment_documents_df['full_text'].iloc[idx]\n",
    "    extracted_equipments = extract(\"Document Path:\" + equipment_documents_df['doc_path'].iloc[idx] + \"\\n\" + text)\n",
    "    EquipmentList.model_validate(extracted_equipments)\n",
    "    df = pd.json_normalize(extracted_equipments[\"equipments\"])\n",
    "    equipment_df = pd.concat([equipment_df, df], ignore_index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "d01d9965-1b3c-48d2-9500-f2c231ec222d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>name</th>\n",
       "      <th>year_of_construction</th>\n",
       "      <th>capacity</th>\n",
       "      <th>built_by</th>\n",
       "      <th>imo_number</th>\n",
       "      <th>port_of_registery</th>\n",
       "      <th>description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>documents/equipment/alexii.pdf</td>\n",
       "      <td>ALEX II</td>\n",
       "      <td>2006</td>\n",
       "      <td>Gross tonnage 548 GT, Net tonnage 164 NT, Leng...</td>\n",
       "      <td>Yizheng Changrun Shipyard</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Floating grab dredger with no propulsion, unre...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>documents/equipment/asian-hercules-iii.pdf</td>\n",
       "      <td>Asian Hercules III</td>\n",
       "      <td>2015</td>\n",
       "      <td>5,000 tons floating sheerleg</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[{'location': 'Singapore', 'country': 'Singapo...</td>\n",
       "      <td>A heavy lift vessel with a floating sheerleg c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>documents/equipment/bear-27-03.pdf</td>\n",
       "      <td>BEAR</td>\n",
       "      <td>1999</td>\n",
       "      <td>Bunker capacity fuel 1545 m3, fresh water 522 ...</td>\n",
       "      <td>None</td>\n",
       "      <td>9185932</td>\n",
       "      <td>[{'location': 'Antwerp', 'country': 'Belgium',...</td>\n",
       "      <td>Offshore vessel used for anchor handling tug s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>documents/equipment/boka-vanguard.pdf</td>\n",
       "      <td>BOKA VANGUARD</td>\n",
       "      <td>2012</td>\n",
       "      <td>Deadweight 116,175 t / 130,000 t</td>\n",
       "      <td>Hyundai Heavy Industries</td>\n",
       "      <td>9618783</td>\n",
       "      <td>[{'location': 'Willemstad', 'country': 'Curaça...</td>\n",
       "      <td>Semi-submersible heavy transport vessel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>documents/equipment/boxer.pdf</td>\n",
       "      <td>BOXER</td>\n",
       "      <td>2010</td>\n",
       "      <td>Bunker capacity 378 cbm, Fuel: 378 m³, Fresh w...</td>\n",
       "      <td>None</td>\n",
       "      <td>9537537</td>\n",
       "      <td>[{'location': 'Valletta', 'country': 'Malta', ...</td>\n",
       "      <td>Offshore vessel / Anchor handling tug (AHT) wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>documents/equipment/bssiii.pdf</td>\n",
       "      <td>BSSIII Burial Sledge System</td>\n",
       "      <td>None</td>\n",
       "      <td>Total installed jetting power 1,800 kW</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Boskalis has developed the burial tool BSSIII,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>documents/equipment/cornelius-backhoe.pdf</td>\n",
       "      <td>Cornelius Backhoe Dredger</td>\n",
       "      <td>1999</td>\n",
       "      <td>None</td>\n",
       "      <td>De Donge / Terramarre</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Special service / Backhoe dredger - no propuls...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>documents/equipment/crestway.pdf</td>\n",
       "      <td>Crestway</td>\n",
       "      <td>2008</td>\n",
       "      <td>Carrying capacity (D.W.) 8,350 t, Hopper capac...</td>\n",
       "      <td>IHC Dredgers B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with mechanica...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>documents/equipment/edax.pdf</td>\n",
       "      <td>EDAX</td>\n",
       "      <td>1985</td>\n",
       "      <td>None</td>\n",
       "      <td>Merwede Shipyard B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Cutter Suction Dredger</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>documents/equipment/giant-7.pdf</td>\n",
       "      <td>GIANT 7</td>\n",
       "      <td>2015</td>\n",
       "      <td>None</td>\n",
       "      <td>Keppel Nantong Shipyard Co., Ltd.</td>\n",
       "      <td>None</td>\n",
       "      <td>[{'location': 'Belgium', 'country': 'Belgium',...</td>\n",
       "      <td>GIANT 7 is a cable lay barge with a classifica...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>documents/equipment/heavy_transport_vessel_for...</td>\n",
       "      <td>FORTE</td>\n",
       "      <td>2012</td>\n",
       "      <td>Deadweight 50,000 t</td>\n",
       "      <td>Guangzhou Shipyard Int. Co. Ltd</td>\n",
       "      <td>9592848</td>\n",
       "      <td>[{'location': 'Valletta', 'country': 'Malta', ...</td>\n",
       "      <td>Semi-submersible DP-2 heavy transport vessel, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>documents/equipment/kamara.pdf</td>\n",
       "      <td>Kamara</td>\n",
       "      <td>2005</td>\n",
       "      <td>Bollard pull ahead 83 t, Deck area 450 m2, Dec...</td>\n",
       "      <td>None</td>\n",
       "      <td>9322607</td>\n",
       "      <td>[{'location': 'Valletta', 'country': 'Malta', ...</td>\n",
       "      <td>DP II Offshore Vessel / Anchor Handling Tug Su...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>documents/equipment/manu-pekka.pdf</td>\n",
       "      <td>MANU-PEKKA</td>\n",
       "      <td>1983</td>\n",
       "      <td>Bucket capacity mud bucket 14 m3, Bucket capac...</td>\n",
       "      <td>OMP Oy, Finland</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Backhoe dredger with a gross tonnage of 680 GT...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>documents/equipment/ndeavor_mpv.pdf</td>\n",
       "      <td>NDEAVOR</td>\n",
       "      <td>2013</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>9650212</td>\n",
       "      <td>[{'location': 'Limassol', 'country': 'Cyprus',...</td>\n",
       "      <td>Multipurpose vessel with diesel electric propu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>documents/equipment/ndurance.pdf</td>\n",
       "      <td>NDURANCE</td>\n",
       "      <td>2013</td>\n",
       "      <td>Turntable capacity 4,300 t</td>\n",
       "      <td>Samsung C&amp;T corporation, ZPMC - Shanghai Zhenh...</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Cable laying vessel with dynamic positioning s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>documents/equipment/rockpiper.pdf</td>\n",
       "      <td>Rockpiper</td>\n",
       "      <td>2011</td>\n",
       "      <td>Rock installation capacity abt. 2,000 t/h. Ins...</td>\n",
       "      <td>Keppel Singmarine Pte Ltd</td>\n",
       "      <td>None</td>\n",
       "      <td>[{'location': 'Limassol', 'country': 'Cyprus',...</td>\n",
       "      <td>Subsea rock installation vessel with diesel el...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>documents/equipment/shoalway.pdf</td>\n",
       "      <td>Shoalway</td>\n",
       "      <td>2010</td>\n",
       "      <td>Hopper capacity 4,500 m3</td>\n",
       "      <td>Intervak scheepswerf &amp; constructie b.v.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with shallow d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>documents/equipment/shoreway.pdf</td>\n",
       "      <td>Shoreway</td>\n",
       "      <td>2008</td>\n",
       "      <td>Carrying capacity (D.W.) 8,350 t, Hopper capac...</td>\n",
       "      <td>IHC Dredgers B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with mechanica...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>documents/equipment/strandway.pdf</td>\n",
       "      <td>Strandway</td>\n",
       "      <td>2014</td>\n",
       "      <td>Hopper capacity 4,500 m3</td>\n",
       "      <td>Shipkits B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with features ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>documents/equipment/terra-plana.pdf</td>\n",
       "      <td>Terra Plana</td>\n",
       "      <td>2016</td>\n",
       "      <td>Max. dredging depth 30 m (can be extended to 4...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[{'location': 'Papendrecht', 'country': 'The N...</td>\n",
       "      <td>Water Injection Dredger / Multi Purpose Vessel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>documents/equipment/trailing_suction_hopper_dr...</td>\n",
       "      <td>Barent Zanen</td>\n",
       "      <td>1984</td>\n",
       "      <td>Hopper capacity 8,116 m3, Carrying capacity 14...</td>\n",
       "      <td>IHC Smit B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with a gross t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>documents/equipment/trailing_suction_hopper_dr...</td>\n",
       "      <td>BEACHWAY</td>\n",
       "      <td>2010</td>\n",
       "      <td>Hopper capacity 8,086 m3</td>\n",
       "      <td>J.J.Sietas KG Schiffwerft GmbH u. Co.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>TRAILING SUCTION HOPPER DREDGER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>documents/equipment/transshelf.pdf</td>\n",
       "      <td>TRANSSHELF</td>\n",
       "      <td>1987</td>\n",
       "      <td>Deadweight 34,030 t</td>\n",
       "      <td>Turku Shipyard Finland</td>\n",
       "      <td>8512279</td>\n",
       "      <td>[{'location': 'Willemstad', 'country': 'Curaça...</td>\n",
       "      <td>Semi-submersible heavy transport vessel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>documents/equipment/waterway.pdf</td>\n",
       "      <td>Waterway</td>\n",
       "      <td>2001</td>\n",
       "      <td>Carrying capacity (D.W.) 7,192 t, Hopper capac...</td>\n",
       "      <td>Merwede Shipyard</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with shallow d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>documents/equipment/willem-van-oranje.pdf</td>\n",
       "      <td>Willem van Oranje</td>\n",
       "      <td>2010</td>\n",
       "      <td>Hopper capacity 12,000 m3, Carrying capacity a...</td>\n",
       "      <td>IHC Dredgers B.V.</td>\n",
       "      <td>None</td>\n",
       "      <td>[]</td>\n",
       "      <td>Trailing suction hopper dredger with 2 separat...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               source  \\\n",
       "0                      documents/equipment/alexii.pdf   \n",
       "1          documents/equipment/asian-hercules-iii.pdf   \n",
       "2                  documents/equipment/bear-27-03.pdf   \n",
       "3               documents/equipment/boka-vanguard.pdf   \n",
       "4                       documents/equipment/boxer.pdf   \n",
       "5                      documents/equipment/bssiii.pdf   \n",
       "6           documents/equipment/cornelius-backhoe.pdf   \n",
       "7                    documents/equipment/crestway.pdf   \n",
       "8                        documents/equipment/edax.pdf   \n",
       "9                     documents/equipment/giant-7.pdf   \n",
       "10  documents/equipment/heavy_transport_vessel_for...   \n",
       "11                     documents/equipment/kamara.pdf   \n",
       "12                 documents/equipment/manu-pekka.pdf   \n",
       "13                documents/equipment/ndeavor_mpv.pdf   \n",
       "14                   documents/equipment/ndurance.pdf   \n",
       "15                  documents/equipment/rockpiper.pdf   \n",
       "16                   documents/equipment/shoalway.pdf   \n",
       "17                   documents/equipment/shoreway.pdf   \n",
       "18                  documents/equipment/strandway.pdf   \n",
       "19                documents/equipment/terra-plana.pdf   \n",
       "20  documents/equipment/trailing_suction_hopper_dr...   \n",
       "21  documents/equipment/trailing_suction_hopper_dr...   \n",
       "22                 documents/equipment/transshelf.pdf   \n",
       "23                   documents/equipment/waterway.pdf   \n",
       "24          documents/equipment/willem-van-oranje.pdf   \n",
       "\n",
       "                           name year_of_construction  \\\n",
       "0                       ALEX II                 2006   \n",
       "1            Asian Hercules III                 2015   \n",
       "2                          BEAR                 1999   \n",
       "3                 BOKA VANGUARD                 2012   \n",
       "4                         BOXER                 2010   \n",
       "5   BSSIII Burial Sledge System                 None   \n",
       "6     Cornelius Backhoe Dredger                 1999   \n",
       "7                      Crestway                 2008   \n",
       "8                          EDAX                 1985   \n",
       "9                       GIANT 7                 2015   \n",
       "10                        FORTE                 2012   \n",
       "11                       Kamara                 2005   \n",
       "12                   MANU-PEKKA                 1983   \n",
       "13                      NDEAVOR                 2013   \n",
       "14                     NDURANCE                 2013   \n",
       "15                    Rockpiper                 2011   \n",
       "16                     Shoalway                 2010   \n",
       "17                     Shoreway                 2008   \n",
       "18                    Strandway                 2014   \n",
       "19                  Terra Plana                 2016   \n",
       "20                 Barent Zanen                 1984   \n",
       "21                     BEACHWAY                 2010   \n",
       "22                   TRANSSHELF                 1987   \n",
       "23                     Waterway                 2001   \n",
       "24            Willem van Oranje                 2010   \n",
       "\n",
       "                                             capacity  \\\n",
       "0   Gross tonnage 548 GT, Net tonnage 164 NT, Leng...   \n",
       "1                        5,000 tons floating sheerleg   \n",
       "2   Bunker capacity fuel 1545 m3, fresh water 522 ...   \n",
       "3                    Deadweight 116,175 t / 130,000 t   \n",
       "4   Bunker capacity 378 cbm, Fuel: 378 m³, Fresh w...   \n",
       "5              Total installed jetting power 1,800 kW   \n",
       "6                                                None   \n",
       "7   Carrying capacity (D.W.) 8,350 t, Hopper capac...   \n",
       "8                                                None   \n",
       "9                                                None   \n",
       "10                                Deadweight 50,000 t   \n",
       "11  Bollard pull ahead 83 t, Deck area 450 m2, Dec...   \n",
       "12  Bucket capacity mud bucket 14 m3, Bucket capac...   \n",
       "13                                               None   \n",
       "14                         Turntable capacity 4,300 t   \n",
       "15  Rock installation capacity abt. 2,000 t/h. Ins...   \n",
       "16                           Hopper capacity 4,500 m3   \n",
       "17  Carrying capacity (D.W.) 8,350 t, Hopper capac...   \n",
       "18                           Hopper capacity 4,500 m3   \n",
       "19  Max. dredging depth 30 m (can be extended to 4...   \n",
       "20  Hopper capacity 8,116 m3, Carrying capacity 14...   \n",
       "21                           Hopper capacity 8,086 m3   \n",
       "22                                Deadweight 34,030 t   \n",
       "23  Carrying capacity (D.W.) 7,192 t, Hopper capac...   \n",
       "24  Hopper capacity 12,000 m3, Carrying capacity a...   \n",
       "\n",
       "                                             built_by imo_number  \\\n",
       "0                           Yizheng Changrun Shipyard       None   \n",
       "1                                                None       None   \n",
       "2                                                None    9185932   \n",
       "3                            Hyundai Heavy Industries    9618783   \n",
       "4                                                None    9537537   \n",
       "5                                                None       None   \n",
       "6                               De Donge / Terramarre       None   \n",
       "7                                   IHC Dredgers B.V.       None   \n",
       "8                               Merwede Shipyard B.V.       None   \n",
       "9                   Keppel Nantong Shipyard Co., Ltd.       None   \n",
       "10                    Guangzhou Shipyard Int. Co. Ltd    9592848   \n",
       "11                                               None    9322607   \n",
       "12                                    OMP Oy, Finland       None   \n",
       "13                                               None    9650212   \n",
       "14  Samsung C&T corporation, ZPMC - Shanghai Zhenh...       None   \n",
       "15                          Keppel Singmarine Pte Ltd       None   \n",
       "16            Intervak scheepswerf & constructie b.v.       None   \n",
       "17                                  IHC Dredgers B.V.       None   \n",
       "18                                      Shipkits B.V.       None   \n",
       "19                                               None       None   \n",
       "20                                      IHC Smit B.V.       None   \n",
       "21              J.J.Sietas KG Schiffwerft GmbH u. Co.       None   \n",
       "22                             Turku Shipyard Finland    8512279   \n",
       "23                                   Merwede Shipyard       None   \n",
       "24                                  IHC Dredgers B.V.       None   \n",
       "\n",
       "                                    port_of_registery  \\\n",
       "0                                                  []   \n",
       "1   [{'location': 'Singapore', 'country': 'Singapo...   \n",
       "2   [{'location': 'Antwerp', 'country': 'Belgium',...   \n",
       "3   [{'location': 'Willemstad', 'country': 'Curaça...   \n",
       "4   [{'location': 'Valletta', 'country': 'Malta', ...   \n",
       "5                                                  []   \n",
       "6                                                  []   \n",
       "7                                                  []   \n",
       "8                                                  []   \n",
       "9   [{'location': 'Belgium', 'country': 'Belgium',...   \n",
       "10  [{'location': 'Valletta', 'country': 'Malta', ...   \n",
       "11  [{'location': 'Valletta', 'country': 'Malta', ...   \n",
       "12                                                 []   \n",
       "13  [{'location': 'Limassol', 'country': 'Cyprus',...   \n",
       "14                                                 []   \n",
       "15  [{'location': 'Limassol', 'country': 'Cyprus',...   \n",
       "16                                                 []   \n",
       "17                                                 []   \n",
       "18                                                 []   \n",
       "19  [{'location': 'Papendrecht', 'country': 'The N...   \n",
       "20                                                 []   \n",
       "21                                                 []   \n",
       "22  [{'location': 'Willemstad', 'country': 'Curaça...   \n",
       "23                                                 []   \n",
       "24                                                 []   \n",
       "\n",
       "                                          description  \n",
       "0   Floating grab dredger with no propulsion, unre...  \n",
       "1   A heavy lift vessel with a floating sheerleg c...  \n",
       "2   Offshore vessel used for anchor handling tug s...  \n",
       "3             Semi-submersible heavy transport vessel  \n",
       "4   Offshore vessel / Anchor handling tug (AHT) wi...  \n",
       "5   Boskalis has developed the burial tool BSSIII,...  \n",
       "6   Special service / Backhoe dredger - no propuls...  \n",
       "7   Trailing suction hopper dredger with mechanica...  \n",
       "8                              Cutter Suction Dredger  \n",
       "9   GIANT 7 is a cable lay barge with a classifica...  \n",
       "10  Semi-submersible DP-2 heavy transport vessel, ...  \n",
       "11  DP II Offshore Vessel / Anchor Handling Tug Su...  \n",
       "12  Backhoe dredger with a gross tonnage of 680 GT...  \n",
       "13  Multipurpose vessel with diesel electric propu...  \n",
       "14  Cable laying vessel with dynamic positioning s...  \n",
       "15  Subsea rock installation vessel with diesel el...  \n",
       "16  Trailing suction hopper dredger with shallow d...  \n",
       "17  Trailing suction hopper dredger with mechanica...  \n",
       "18  Trailing suction hopper dredger with features ...  \n",
       "19     Water Injection Dredger / Multi Purpose Vessel  \n",
       "20  Trailing suction hopper dredger with a gross t...  \n",
       "21                    TRAILING SUCTION HOPPER DREDGER  \n",
       "22            Semi-submersible heavy transport vessel  \n",
       "23  Trailing suction hopper dredger with shallow d...  \n",
       "24  Trailing suction hopper dredger with 2 separat...  "
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "equipment_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdbc9c04-f6ea-4de6-a2a0-6ec13089b2d2",
   "metadata": {},
   "source": [
    "### Load Equipment to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "877ec967-99ab-427e-9614-66e5826c2874",
   "metadata": {},
   "outputs": [],
   "source": [
    "CREATE_EQUIPMENT_QUERY = \"\"\"\n",
    "    MERGE (e:Equipment {name: $name})\n",
    "    SET  e.doc_path = $doc_path,\n",
    "         e.year_of_construction = $year_of_construction,\n",
    "         e.capacity = $capacity,\n",
    "         e.imo_number = $imo_number,\n",
    "         e.description = $description\n",
    "    \n",
    "    WITH e\n",
    "    CALL (e) {\n",
    "        MATCH (d:Document{doc_path: $doc_path})\n",
    "        MERGE (e)-[:HAS_DOCUMENT]->(d)\n",
    "    }\n",
    "    \n",
    "    WITH e\n",
    "    CALL (e) {\n",
    "        UNWIND $port_of_registery AS l\n",
    "        MERGE (loc:Location {name: l.location})\n",
    "        MERGE (country:Country {code: l.country_code})\n",
    "        SET country.name = l.country\n",
    "        MERGE (loc)-[:IN_COUNTRY]->(country)\n",
    "        MERGE (e)-[:REGISTERED_AT]->(loc)\n",
    "    }\n",
    "    ;\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "b4c287aa-a985-45bc-9c3c-a2006db72bbd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_equipment_row(row):\n",
    "    driver.execute_query(\n",
    "        CREATE_EQUIPMENT_QUERY,\n",
    "        name=row[\"name\"],\n",
    "        doc_path=row[\"doc_path\"],\n",
    "        year_of_construction=row[\"year_of_construction\"],\n",
    "        capacity=row[\"capacity\"],\n",
    "        built_by=row[\"built_by\"],\n",
    "        imo_number=row[\"imo_number\"],\n",
    "        description=row[\"description\"],\n",
    "        port_of_registery=row[\"port_of_registery\"],\n",
    "        database_=DATABASE,\n",
    "        routing_=RoutingControl.WRITE,\n",
    "    )\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "961d6976-6a11-4e62-adab-638ffc5f902a",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "for idx, row in equipment_df.iterrows():\n",
    "    insert_equipment_row(row)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1da6330f-368a-4100-8fdd-57070607b7bb",
   "metadata": {},
   "source": [
    "## Resolve duplicate Entities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a359a044-5618-48d4-8d0e-bee5ad7a0fc1",
   "metadata": {},
   "source": [
    "Refactor locations in countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "bc032501-698c-4a02-bb6f-9d87c105fcaa",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = driver.execute_query(\n",
    "    \"\"\"\n",
    "        MATCH ()-[r1]-(l:Location)-[r2:IN_COUNTRY]-(c:Country)\n",
    "        WHERE l.name = c.name\n",
    "        DELETE r2\n",
    "        WITH r1, c\n",
    "        CALL apoc.refactor.to(r1, c) YIELD input, output\n",
    "        RETURN input, output\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.WRITE,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aef07ebe-b38f-436d-a981-e80465819514",
   "metadata": {},
   "source": [
    "Refactor equipment names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "a3d1f48f-fb68-4eb4-90b8-23924f39fec2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>e1.name</th>\n",
       "      <th>similar_names</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Asian Hercules III</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Willem van Oranje</td>\n",
       "      <td>[TSHD Willem van Oranje, TSHD Willem van Oranje]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Waterway</td>\n",
       "      <td>[TSHD Waterway]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ALEX II</td>\n",
       "      <td>[Alex II]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BEAR</td>\n",
       "      <td>[Union Bear]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>BOKA VANGUARD</td>\n",
       "      <td>[MV Boka Vanguard]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>BOXER</td>\n",
       "      <td>[Union Boxer]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>BSSIII Burial Sledge System</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Cornelius Backhoe Dredger</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Crestway</td>\n",
       "      <td>[TSHD Crestway]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>EDAX</td>\n",
       "      <td>[Edax, Cutter suction dredger Edax]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>GIANT 7</td>\n",
       "      <td>[Cable Lay Barge Giant 7]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>FORTE</td>\n",
       "      <td>[Forte]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Kamara</td>\n",
       "      <td>[Smit Kamara]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>MANU-PEKKA</td>\n",
       "      <td>[BHD Manu Pekka, Manu Pekka]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>NDEAVOR</td>\n",
       "      <td>[Cable Lay Vessel Ndeavor, NDeavor]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>NDURANCE</td>\n",
       "      <td>[NDurance, Cable Lay Vessel Ndurance]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Shoalway</td>\n",
       "      <td>[TSHD Shoalway, TSHD Shoalway]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Strandway</td>\n",
       "      <td>[TSHD Strandway]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Terra Plana</td>\n",
       "      <td>[WID Terra Plana]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Rockpiper</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Shoreway</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Barent Zanen</td>\n",
       "      <td>[TSHd 'Barent Zanen']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>BEACHWAY</td>\n",
       "      <td>[Beachway]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>TRANSSHELF</td>\n",
       "      <td>[Transshelf]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        e1.name  \\\n",
       "0            Asian Hercules III   \n",
       "1             Willem van Oranje   \n",
       "2                      Waterway   \n",
       "3                       ALEX II   \n",
       "4                          BEAR   \n",
       "5                 BOKA VANGUARD   \n",
       "6                         BOXER   \n",
       "7   BSSIII Burial Sledge System   \n",
       "8     Cornelius Backhoe Dredger   \n",
       "9                      Crestway   \n",
       "10                         EDAX   \n",
       "11                      GIANT 7   \n",
       "12                        FORTE   \n",
       "13                       Kamara   \n",
       "14                   MANU-PEKKA   \n",
       "15                      NDEAVOR   \n",
       "16                     NDURANCE   \n",
       "17                     Shoalway   \n",
       "18                    Strandway   \n",
       "19                  Terra Plana   \n",
       "20                    Rockpiper   \n",
       "21                     Shoreway   \n",
       "22                 Barent Zanen   \n",
       "23                     BEACHWAY   \n",
       "24                   TRANSSHELF   \n",
       "\n",
       "                                       similar_names  \n",
       "0                                                 []  \n",
       "1   [TSHD Willem van Oranje, TSHD Willem van Oranje]  \n",
       "2                                    [TSHD Waterway]  \n",
       "3                                          [Alex II]  \n",
       "4                                       [Union Bear]  \n",
       "5                                 [MV Boka Vanguard]  \n",
       "6                                      [Union Boxer]  \n",
       "7                                                 []  \n",
       "8                                                 []  \n",
       "9                                    [TSHD Crestway]  \n",
       "10               [Edax, Cutter suction dredger Edax]  \n",
       "11                         [Cable Lay Barge Giant 7]  \n",
       "12                                           [Forte]  \n",
       "13                                     [Smit Kamara]  \n",
       "14                      [BHD Manu Pekka, Manu Pekka]  \n",
       "15               [Cable Lay Vessel Ndeavor, NDeavor]  \n",
       "16             [NDurance, Cable Lay Vessel Ndurance]  \n",
       "17                    [TSHD Shoalway, TSHD Shoalway]  \n",
       "18                                  [TSHD Strandway]  \n",
       "19                                 [WID Terra Plana]  \n",
       "20                                                []  \n",
       "21                                                []  \n",
       "22                             [TSHd 'Barent Zanen']  \n",
       "23                                        [Beachway]  \n",
       "24                                      [Transshelf]  "
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "merged_df = driver.execute_query(\n",
    "    \"\"\"\n",
    "        MATCH (e1:Equipment)\n",
    "        WHERE e1.doc_path IS NOT NULL\n",
    "        CALL (e1) {\n",
    "         MATCH (e2:Equipment)\n",
    "         WITH e1, e2, \n",
    "         apoc.text.join(apoc.coll.sort(split(trim( apoc.text.replace(apoc.text.replace(lower(e1.name), \"[^a-z0-9 ]\", \" \"), \"\\\\s+\", \" \")), \" \")), \" \") as normalized_1,\n",
    "         apoc.text.join(apoc.coll.sort(split(trim( apoc.text.replace(apoc.text.replace(lower(e2.name), \"[^a-z0-9 ]\", \" \"), \"\\\\s+\", \" \")), \" \")), \" \") as normalized_2\n",
    "         WHERE e1 <> e2 AND (LOWER(replace(normalized_2, \" \", \"\")) CONTAINS LOWER(replace(normalized_1, \" \", \"\")) OR (apoc.text.replace(lower(e2.name), \"[^a-z0-9 ]\", \" \") CONTAINS apoc.text.replace(lower(e1.name), \"[^a-z0-9 ]\", \" \")))\n",
    "         WITH e1, e2 \n",
    "         OPTIONAL MATCH (:Project)-[r]->(e2)\n",
    "         CALL apoc.refactor.to(r, e1) YIELD input, output\n",
    "         WITH COLLECT(e2.name) as similar_names\n",
    "         RETURN similar_names\n",
    "        }\n",
    "        WITH e1, similar_names\n",
    "        CALL (similar_names) {\n",
    "          UNWIND similar_names as name\n",
    "          MATCH (e:Equipment{name: name})\n",
    "          DELETE e\n",
    "        }\n",
    "        WITH e1, similar_names\n",
    "        RETURN e1.name, similar_names\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.WRITE,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")\n",
    "merged_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "f769732e-d1da-44f5-a8ab-c72f3719c905",
   "metadata": {},
   "outputs": [],
   "source": [
    "equipment_names_df = driver.execute_query(\n",
    "    \"\"\"\n",
    "        MATCH (e1:Equipment)\n",
    "        WHERE e1.doc_path IS NOT NULL\n",
    "        RETURN e1.name as equipment_name\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.READ,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")\n",
    "equipment_names = list(equipment_names_df['equipment_name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "66740355-3d37-409f-87d9-47090496df2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "equipment_names_df = driver.execute_query(\n",
    "    \"\"\"\n",
    "        MATCH (e1:Equipment)\n",
    "        WHERE e1.doc_path IS NULL\n",
    "        RETURN e1.name as equipment_name\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.READ,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")\n",
    "parsed_names = list(equipment_names_df['equipment_name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "5473762b-445c-4b6e-8e97-c2d010e7b695",
   "metadata": {},
   "outputs": [],
   "source": [
    "def detect_duplicates(equipment_names, parsed_names):\n",
    "    prompt = f\"\"\"\n",
    "        You are an entity resolution assistant.\n",
    "        Given the following list of equipment names:\n",
    "        equipment_names:\n",
    "        {equipment_names}\n",
    "\n",
    "        can you find any equipment names in the following list that describe the same equipment?\n",
    "        potential_duplicates:\n",
    "        {parsed_names}\n",
    "        \n",
    "        Return ONLY a JSON object with the following structure:\n",
    "        {{\n",
    "            \"groups\": [\n",
    "                {{\n",
    "                    \"canonical\": \"<name>\",\n",
    "                    \"duplicates\": [\"duplicate1\", \"duplicate2\", ...]\n",
    "                }},\n",
    "                ...\n",
    "            ]\n",
    "        }}\n",
    "        \n",
    "        Rules:\n",
    "        - Only include TRUE duplicates (different spellings or formatting of the same equipment).\n",
    "        - Do NOT include generic categories (e.g., \"TSHDs\"). \n",
    "        - Please focus on equipment names instead of generic descriptions (Grab dredger can be ignored). \n",
    "        - If the duplicates list is empty, don't return the group. Only return groups with duplicates.\n",
    "        - Only return the JSON object no prefix or whatsoever. \n",
    "        - The canonical should always come from the equipment name. The duplicates can only be coming from the potential_duplicates.\n",
    "    \"\"\"\n",
    "\n",
    "    response = client.chat.completions.create(\n",
    "        model=LLM,\n",
    "        messages=[{\"role\": \"user\", \"content\": prompt}]\n",
    "    )\n",
    "    content = response.choices[0].message.content.strip()[8:-4]\n",
    "    try:\n",
    "        data = json.loads(content)\n",
    "    except json.JSONDecodeError:\n",
    "        raise ValueError(\"LLM returned invalid JSON:\\n\" + content)\n",
    "    return data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "3d8fd0b8-080e-4f7f-ba46-dcadf1ecd988",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = detect_duplicates(equipment_names, parsed_names)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "40ef6192-f777-41e3-94dc-40cf1373bf11",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'groups': [{'canonical': 'BSSIII Burial Sledge System',\n",
       "   'duplicates': ['Burial Sledge BSS-III']},\n",
       "  {'canonical': 'Cornelius Backhoe Dredger', 'duplicates': ['Cornelius']},\n",
       "  {'canonical': 'Willem van Oranje',\n",
       "   'duplicates': ['Oranje', 'TSHD ‘Oranje’']}]}"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "e396c618-7a93-44db-99e0-a46e8345c3b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def merge_duplicate_group(canonical, duplicates):\n",
    "    print(f\"Merging duplicates into: {canonical}\")\n",
    "\n",
    "    driver.execute_query(\n",
    "        \"\"\"\n",
    "            MATCH (c:Equipment {name: $canonical})\n",
    "            WHERE c.doc_path IS NOT NULL\n",
    "            WITH c\n",
    "            UNWIND $dups AS dupName\n",
    "                MATCH (d:Equipment {name: dupName})\n",
    "                OPTIONAL MATCH (p)-[r]->(d)\n",
    "                CALL apoc.refactor.to(r, c) YIELD input, output\n",
    "                DETACH DELETE d\n",
    "            RETURN c.name AS kept\n",
    "        \"\"\",\n",
    "        database_=DATABASE,\n",
    "        canonical=canonical,\n",
    "        dups=duplicates,\n",
    "        routing_=RoutingControl.WRITE,\n",
    "        result_transformer_=lambda r: r.to_df()\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "9a1407b0-cf22-4c4e-b745-a5c014ecde10",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'canonical': 'BSSIII Burial Sledge System',\n",
       "  'duplicates': ['Burial Sledge BSS-III']},\n",
       " {'canonical': 'Cornelius Backhoe Dredger', 'duplicates': ['Cornelius']},\n",
       " {'canonical': 'Willem van Oranje', 'duplicates': ['Oranje', 'TSHD ‘Oranje’']}]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data['groups']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "2fe4b0db-5341-42d3-969b-16a8474d5c65",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Merging duplicates into: BSSIII Burial Sledge System\n",
      "Merging duplicates into: Cornelius Backhoe Dredger\n",
      "Merging duplicates into: Willem van Oranje\n"
     ]
    }
   ],
   "source": [
    "for group in data['groups']:\n",
    "    canonical = group[\"canonical\"]\n",
    "    duplicates = group[\"duplicates\"]\n",
    "    merge_duplicate_group(canonical, duplicates)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "b7313018-df34-4823-b3b4-c558dfeb17eb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(\n",
    "    \"\"\"\n",
    "    MATCH (a)-[r:USED_EQUIPMENT]->(b)\n",
    "    WITH a, b, collect(r) AS rels\n",
    "    WHERE size(rels) > 1\n",
    "    FOREACH (r IN rels[1..] | DELETE r)\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.WRITE,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6eb03805-46a9-4781-be68-93f5f6b11e6d",
   "metadata": {},
   "source": [
    "### Delete doc_path from Project/Equipment"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96fe402f-c1d8-41f7-8888-268f2c97ba3f",
   "metadata": {},
   "source": [
    "Now that we have relations to documents we can delete the doc_path from Project and Equipment and give the URL instead."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e9d3d1f4-419f-4916-8ef6-e3408ace2ed8",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.execute_query(\n",
    "    \"\"\"\n",
    "    MATCH (p:Project|Equipment)\n",
    "    SET p.doc_path = NULL\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.WRITE,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f27b06e7-b335-4367-95c6-2edbb0c398fd",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'driver' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mNameError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[1]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m \u001b[43mdriver\u001b[49m.execute_query(\n\u001b[32m      2\u001b[39m \u001b[38;5;250m    \u001b[39m\u001b[33;03m\"\"\"\u001b[39;00m\n\u001b[32m      3\u001b[39m \u001b[33;03m    MATCH (p:Project|Equipment)-[]-(d:Document)\u001b[39;00m\n\u001b[32m      4\u001b[39m \u001b[33;03m    SET p.url = d.url\u001b[39;00m\n\u001b[32m      5\u001b[39m \u001b[33;03m    \"\"\"\u001b[39;00m,\n\u001b[32m      6\u001b[39m     database_=DATABASE,\n\u001b[32m      7\u001b[39m     routing_=RoutingControl.WRITE,\n\u001b[32m      8\u001b[39m     result_transformer_=\u001b[38;5;28;01mlambda\u001b[39;00m r: r.to_df()\n\u001b[32m      9\u001b[39m )\n",
      "\u001b[31mNameError\u001b[39m: name 'driver' is not defined"
     ]
    }
   ],
   "source": [
    "driver.execute_query(\n",
    "    \"\"\"\n",
    "    MATCH (p:Project|Equipment)-[]-(d:Document)\n",
    "    SET p.url = d.url\n",
    "    \"\"\",\n",
    "    database_=DATABASE,\n",
    "    routing_=RoutingControl.WRITE,\n",
    "    result_transformer_=lambda r: r.to_df()\n",
    ")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
